// Файл FrontEnd.h
// Точка подключения всех возможностей блока 700_CSysLaunch
//

#ifndef _700_CSysLaunch_FrontEnd_h
#define _700_CSysLaunch_FrontEnd_h




//=====================================================================================================================
// Сюда надо подключать заголовочные файлы данного проекта
#include "Settings.h"




//=====================================================================================================================
// Описание новой системы и её типа
#include "90_System/01_CSysLaunchType.h"
#include "90_System/02_CSysLaunch.h"




//=====================================================================================================================
// Подключение файла статической библиотеки при компиляции
#if !defined(USED_CMAKE_BUILD_TOOL)   &&   defined(COMPILER_MICROSOFT)
__pragma(comment(lib, "700_CSysLaunch"))
#endif




//=====================================================================================================================
#endif
