// Файл 01_CEquationQuadratic.h
// Обыкновенное квадратное уравнение
//

#ifndef Math_Algebra_CEquationQuadratic_h
#define Math_Algebra_CEquationQuadratic_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"


//=====================================================================================================================
// Обыкновенное квадратное уравнение
//    a*x^2 + b*x + c = 0
class CEquationQuadratic
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    double myA;     // Коэффициент при старшем члене
    double myB;     // Коэффициент при линейном члене
    double myC;     // Свободный член


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CEquationQuadratic(double a, double b, double c);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Признак вырожденного уравнения
    bool isConfluent() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Вычисление корней уравнения
    vector<double> solve() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif
