// Файл 02_CEquationCubic.h
// Обыкновенное кубическое уравнение
//

#ifndef Math_Algebra_CEquationCubic_h
#define Math_Algebra_CEquationCubic_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"


//=====================================================================================================================
// Обыкновенное кубическое уравнение
//    a*x^3 + b*x^2 + c*x + d = 0
class CEquationCubic
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    double myA;     // Коэффициент при старшем члене
    double myB;     // Коэффициент при квадратичном члене 
    double myC;     // Коэффициент при линейном члене
    double myD;     // Свободный член


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CEquationCubic(double a, double b, double c, double d);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Признак вырожденного уравнения
    bool isConfluent() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Вычисление корней уравнения
    vector<double> solve() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif
