// Файл 03_CEquationQuartic.h
// Обыкновенное уравнение четвёртой степени
//

#ifndef Math_Algebra_CEquationQuartic_h
#define Math_Algebra_CEquationQuartic_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"


//=====================================================================================================================
// Обыкновенное уравнение четвёртой степени
//    a*x^4 + b*x^3 + c*x^2 + d*x + e = 0
class CEquationQuartic
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    double myA;     // Коэффициент при старшем члене
    double myB;     // Коэффициент при кубичном члене 
    double myC;     // Коэффициент при квадратичном члене 
    double myD;     // Коэффициент при линейном члене
    double myE;     // Свободный член


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CEquationQuartic(double a, double b, double c, double d, double e);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Признак вырожденного уравнения
    bool isConfluent() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Вычисление корней уравнения
    vector<double> solve() const;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Вспомогательные функции
    static bool _checkEQ(const vector<double> &left, const vector<double> &right);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif
