// Файл 01_CControlChar.cpp
// Управляющий символ
//

//=====================================================================================================================
// Заголовочные файлы
#include "01_CControlChar.h"




//=====================================================================================================================
// Перечень стандартных управляющих символов
CControlChar CControlChar::myTab;
CControlChar CControlChar::myLine;
CControlChar CControlChar::mySpace;




//=====================================================================================================================
// Конструктор класса
CControlChar::CControlChar()
{
}


