// Файл 02_CPointGlobal.h
// Положение моделируемого объекта в геоцентрической декартовой системе координат
//

#ifndef Core_CoordSystems_CPointGlobal_h
#define Core_CoordSystems_CPointGlobal_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "01_CPointLocal.h"


//=====================================================================================================================
// Положение моделируемого объекта в геоцентрической декартовой системе координат
class CPointGeo;
class CPointGlobal: private CPointLocal
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CPointGlobal();
    CPointGlobal(double t, const CPoint3D &pos, double roll = 0.0);
    CPointGlobal(double t, const CPoint3D &pos, const CVector3D &vel, double roll = 0.0);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Пересчёт положения объекта в геодезическую систему координат
    CPointGeo toPointGeo() const;

    // Пересчёт положения объекта в местную декартову систему координат
    CPointLocal toPointLocal(const CPoint3D &ortho) const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам положения объекта
    using CPointLocal::getTime;
    using CPointLocal::getPosition;
    using CPointLocal::getVelocity;
    using CPointLocal::getRoll;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Изменение параметров положения объекта
    using CPointLocal::setTime;
    using CPointLocal::setPosition;
    using CPointLocal::setVelocity;
    using CPointLocal::setRoll;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Направление мгновенной скорости на заданную точку
    using CPointLocal::adjustVelocityTo;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Перенос начала координат в заданную точку
    using CPointLocal::moveOrthoTo;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Поворот координатной плоскости xOy вокруг оси Oz в направлении от Ox к Oy
    using CPointLocal::rotatePlaneXY;

    // Поворот координатной плоскости yOz вокруг оси Ox в направлении от Oy к Oz
    using CPointLocal::rotatePlaneYZ;

    // Поворот координатной плоскости zOx вокруг оси Oy в направлении от Oz к Ox
    using CPointLocal::rotatePlaneZX;

    // Переход к новым координатным осям
    using CPointLocal::changeBasis;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Вспомогательная функция для преобразования в геодезическую СК
    static void _transformToSpheric(const CPoint3D &point, double &lat, double &lon, double &alt);

    // Вспомогательная функция для преобразования в местную декартову СК
    static CPoint3D _transformToLocal(const CPoint3D &point, const CPoint3D &ortho);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


