// Файл 03_CPointGeo.h
// Положение моделируемого объекта в геодезической системе координат
//

#ifndef Core_CoordSystems_CPointGeo_h
#define Core_CoordSystems_CPointGeo_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"


//=====================================================================================================================
// Положение моделируемого объекта в геодезической системе координат
class CPointGlobal;
class CPointGeo
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    double myTime;          // Момент времени [с]
    double myLatitude;      // Текущая широта [радианы]
    double myLongitude;     // Текущая долгота [радианы]
    double myAltitude;      // Текущая высота над поверхностью Земли [м]
    CVector3D myVelocity;   // Вектор мгновенной скорости (на всякий случай, чтобы можно было преобразовать туда-сюда)
    double myRoll;          // Мгновенный крен относительно горизонта [градусы]


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CPointGeo();
    CPointGeo(double t, double latitude, double longitude, double altitude = 0.0, double roll = 0.0);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Пересчёт положения объекта в геоцентрическую систему координат
    CPointGlobal toPointGlobal() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам положения объекта
    double getTime() const;
    double getLatitude() const;
    double getLongitude() const;
    double getAltitude() const;
    double getRoll() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Изменение параметров положения объекта
    void setTime(double time);
    void setVelocity(const CVector3D &vel);
    void setPosition(double latitude, double longitude);
    void setPosition(double latitude, double longitude, double altitude);
    void setAltitude(double altitude);
    void setRoll(double roll);


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Вспомогательная функция для преобразования в геоцентрическую декартову СК
    static void _transformToCartesian(double lat, double lon, double alt, CPoint3D &point);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


