// Файл 01_CInterpolator.h
// Линейный интерполятор
//

#ifndef Math_Calculus_CInterpolator_h
#define Math_Calculus_CInterpolator_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"


//=====================================================================================================================
// Линейный интерполятор
class CInterpolator
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    double myLeftArg;       // Значение агрумента на левой границе отрезка
    double myLeftFunc;      // Значение функции на левой границе отрезка  

    double myRightArg;      // Значение агрумента на правой границе отрезка
    double myRightFunc;     // Значение функции на правой границе отрезка

    double myK;             // Коэффициент при линейном члене
    double myB;             // Коэффициент при свободном члене


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CInterpolator(double leftArg, double leftFunc, double rightArg, double rightFunc);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Вычисление значения функции в точке
    double computeFuncAt(double x) const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам интерполятора
    double getLeftArg() const;
    double getLeftFunc() const;

    double getRightArg() const;
    double getRightFunc() const;

    double getK() const;
    double getB() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif
