#ifndef _600_OpticThermal_Environment_CEarth_h
#define _600_OpticThermal_Environment_CEarth_h


//=============================================================================
// Заголовочные файлы


namespace SysOpticThermal
{
    //=============================================================================
    // Класс "Планета Земля"
    class CEarth
    {
    private:
        //-------------------------------------------------------------------------
        // Параметры планеты
        double myMinorRadius;     // Меньший (полярный) радиус [м]
        double myMajorRadius;     // Больший (экваториальный) радиус [м]


    public:
        //-------------------------------------------------------------------------
        // Конструкторы класса
        CEarth();


    public:
        //-------------------------------------------------------------------------
        // Доступ к параметрам Земли
        double getMinorRadius() const;
        double getMajorRadius() const;


    public:
        //-------------------------------------------------------------------------
        // Настройка параметров Земли
        void setSize(double minorRadius, double majorRadius);


        //-------------------------------------------------------------------------
    };


    //=============================================================================
}


//=============================================================================
#endif

