// Файл 01_CImpactAppear.h
// Воздействие "Появление моделируемого объекта"
//

#ifndef Core_DataExchange_CImpactAppear_h
#define Core_DataExchange_CImpactAppear_h


//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"


//=====================================================================================================================
// Воздействие "Появление моделируемого объекта"
class CImpactAppear: public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myAbsNum;        // Номер появившегося объекта


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactAppear(size_t absNum);
    
    // Деструктор класса
    virtual ~CImpactAppear();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getAbsNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


