// Файл 01_CImpactAppear.cpp
// Воздействие "Появление моделируемого объекта"
//

//=====================================================================================================================
// Заголовочные файлы
#include "01_CImpactAppear.h"




//=====================================================================================================================
// Конструктор класса
CImpactAppear::CImpactAppear(size_t absNum)
{
    myAbsNum = absNum;
}




//=====================================================================================================================
// Деструктор класса
CImpactAppear::~CImpactAppear()
{
}




//=====================================================================================================================
// Доступ к параметрам воздействия
size_t CImpactAppear::getAbsNum() const
{
    return myAbsNum;
}



