// Файл 02_CImpactDestroy.cpp
// Воздействие "Уничтожение моделируемого объекта"
//

//=====================================================================================================================
// Заголовочные файлы
#include "02_CImpactDestroy.h"




//=====================================================================================================================
// Конструктор класса
CImpactDestroy::CImpactDestroy(size_t absNum)
{
    myAbsNum = absNum;
}




//=====================================================================================================================
// Деструктор класса
CImpactDestroy::~CImpactDestroy()
{
}




//=====================================================================================================================
// Доступ к параметрам воздействия
size_t CImpactDestroy::getAbsNum() const
{
    return myAbsNum;
}



