// Файл 02_CImpactDestroy.h
// Воздействие "Уничтожение моделируемого объекта"
//

#ifndef Core_DataExchange_CImpactDestroy_h
#define Core_DataExchange_CImpactDestroy_h


//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"


//=====================================================================================================================
// Воздействие "Уничтожение моделируемого объекта"
class CImpactDestroy : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myAbsNum;        // Номер уничтоженного объекта


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactDestroy(size_t absNum);

    // Деструктор класса
    virtual ~CImpactDestroy();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getAbsNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


