// Файл 03_CImpactDisappear.cpp
// Воздействие "Исчезновение моделируемого объекта"
//

//=====================================================================================================================
// Заголовочные файлы
#include "03_CImpactDisappear.h"




//=====================================================================================================================
// Конструктор класса
CImpactDisappear::CImpactDisappear(size_t absNum)
{
    myAbsNum = absNum;
}




//=====================================================================================================================
// Деструктор класса
CImpactDisappear::~CImpactDisappear()
{
}




//=====================================================================================================================
// Доступ к параметрам воздействия
size_t CImpactDisappear::getAbsNum() const
{
    return myAbsNum;
}



