// Файл 03_CImpactDisappear.h
// Воздействие "Исчезновение моделируемого объекта"
//

#ifndef Core_DataExchange_CImpactDisappear_h
#define Core_DataExchange_CImpactDisappear_h


//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"


//=====================================================================================================================
// Воздействие "Исчезновение моделируемого объекта"
class CImpactDisappear : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myAbsNum;        // Номер появившегося объекта


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactDisappear(size_t absNum);

    // Деструктор класса
    virtual ~CImpactDisappear();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getAbsNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


