// Файл 04_CImpactTargetNew.h
// Воздействие "Обнаружение объекта"
//

#ifndef Core_DataExchange_CImpactTargetNew_h
#define Core_DataExchange_CImpactTargetNew_h


//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"


//=====================================================================================================================
// Воздействие "Обнаружение объекта"
class CImpactTargetNew: public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myAbsNum;        // Номер обнаруженного объекта


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactTargetNew(size_t absNum);
    
    // Деструктор класса
    virtual ~CImpactTargetNew();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getAbsNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


