// Файл 04_CImpactTargetNew.cpp
// Воздействие "Обнаружение объекта"
//

//=====================================================================================================================
// Заголовочные файлы
#include "04_CImpactTargetNew.h"




//=====================================================================================================================
// Конструктор класса
CImpactTargetNew::CImpactTargetNew(size_t absNum)
{
    myAbsNum = absNum;
}




//=====================================================================================================================
// Деструктор класса
CImpactTargetNew::~CImpactTargetNew()
{
}




//=====================================================================================================================
// Доступ к параметрам воздействия
size_t CImpactTargetNew::getAbsNum() const
{
    return myAbsNum;
}



