// Файл 05_CImpactTargetLost.cpp
// Воздействие "Потеря объекта"
//

//=====================================================================================================================
// Заголовочные файлы
#include "05_CImpactTargetLost.h"




//=====================================================================================================================
// Конструктор класса
CImpactTargetLost::CImpactTargetLost(size_t absNum)
{
    myAbsNum = absNum;
}




//=====================================================================================================================
// Деструктор класса
CImpactTargetLost::~CImpactTargetLost()
{
}




//=====================================================================================================================
// Доступ к параметрам воздействия
size_t CImpactTargetLost::getAbsNum() const
{
    return myAbsNum;
}



