// Файл 05_CImpactTargetLost.h
// Воздействие "Потеря объекта"
//

#ifndef Core_DataExchange_CImpactTargetLost_h
#define Core_DataExchange_CImpactTargetLost_h


//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"


//=====================================================================================================================
// Воздействие "Потеря объекта"
class CImpactTargetLost : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myAbsNum;        // Номер появившегося объекта


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactTargetLost(size_t absNum);
    
    // Деструктор класса
    virtual ~CImpactTargetLost();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getAbsNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


