// Файл 06_CImpactLaunchWeapon.cpp
// Воздействие "Команда на пуск оружия по цели"
//

//=====================================================================================================================
// Заголовочные файлы
#include "06_CImpactLaunchWeapon.h"




//=====================================================================================================================
// Конструктор класса
CImpactLaunchWeapon::CImpactLaunchWeapon(size_t targetNum)
    : myTargetNum(targetNum)
{
}




//=====================================================================================================================
// Деструктор класса
CImpactLaunchWeapon::~CImpactLaunchWeapon()
{
}




//=====================================================================================================================
// Доступ к параметрам воздействия
size_t CImpactLaunchWeapon::getTargetNum() const
{
    return myTargetNum;
}



