// Файл 06_CImpactLaunchWeapon.h
// Воздействие "Команда на пуск оружия по цели"
//

#ifndef Core_DataExchange_CImpactLaunchWeapon_h
#define Core_DataExchange_CImpactLaunchWeapon_h


//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"


//=====================================================================================================================
// Воздействие "Команда на пуск оружия по цели"
class CImpactLaunchWeapon : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myTargetNum;             // Глобальный номер цели


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactLaunchWeapon(size_t targetNum);
    
    // Деструктор класса
    virtual ~CImpactLaunchWeapon();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getTargetNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


