// Файл 07_CImpactWeaponLaunchSimple.h
// Воздействие "Команда на пуск оружия по цели", которая передаётся от Системы пуска АСП в АСП (Система пуска АСП->АСП)
//

#ifndef Core_DataExchange_CImpactWeaponLaunchSimple_h
#define Core_DataExchange_CImpactWeaponLaunchSimple_h


//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"


//=====================================================================================================================
// Воздействие "Команда на пуск оружия по цели", которая передаётся от Системы пуска АСП в АСП (Система пуска АСП->АСП)
class CImpactWeaponLaunchSimple : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myTargetAbsNum;        // Глобальный номер цели


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactWeaponLaunchSimple(size_t targetAbsNum);

    // Деструктор класса
    virtual ~CImpactWeaponLaunchSimple();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getAbsNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif
