// Файл 08_CImpactWeaponExplosion.h
// Воздействие "Подрыв БЧ АСП", которое отсылает АСП в систему пуска АСП 
//

#ifndef Core_DataExchange_CImpactWeaponExplosion_h
#define Core_DataExchange_CImpactWeaponExplosion_h




//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../../02_TaskReader/01_CTaskPoint.h"
#include "../01_CImpact.h"




//=====================================================================================================================
// Воздействие "Подрыв БЧ АСП", которое отсылает АСП в систему пуска АСП 
class CImpactWeaponExplosion : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myWeaponAbsNum;              // Глобальный номер применяемого АСП
    CTaskPoint myExplosionPoint;        // Точка подрыва БЧ применяемого АСП

public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactWeaponExplosion(size_t weaponAbsNum, const CTaskPoint &explosionPoint);

    // Деструктор класса
    virtual ~CImpactWeaponExplosion();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getAbsNum() const;
    const CTaskPoint & getExplosionPoint() const;

    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif

