// Файл 09_CImpactTargetHit.h
// Воздействие "Поражение цели"
//
#ifndef Core_DataExchange_CImpactTargetHit_h
#define Core_DataExchange_CImpactTargetHit_h




//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"




//=====================================================================================================================
// Воздействие "Поражение цели"
class CImpactTargetHit : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myTargetAbsNum;        // Глобальный номер цели


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactTargetHit(size_t targetAbsNum);

    // Деструктор класса
    virtual ~CImpactTargetHit();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getAbsNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif
