// Файл 09_CImpactTargetHit.cpp
// Воздействие "Поражение цели"
//
// Заголовочные файлы
#include "09_CImpactTargetHit.h"




//=====================================================================================================================
// Конструктор класса
CImpactTargetHit::CImpactTargetHit(size_t targetAbsNum)
{
    myTargetAbsNum = targetAbsNum;
}




//=====================================================================================================================
// Деструктор класса
CImpactTargetHit::~CImpactTargetHit()
{
}




//=====================================================================================================================
// Доступ к параметрам воздействия
size_t CImpactTargetHit::getAbsNum() const
{
    return myTargetAbsNum;
}


