// Файл 10_CImpactFireDelay.h
// Воздействие "Команда блокировки системы пуска"
//

#ifndef Core_DataExchange_CImpactFireDelay_h
#define Core_DataExchange_CImpactFireDelay_h




//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"




//=====================================================================================================================
// Воздействие "Команда блокировки системы пуска"
class CImpactFireDelay : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    double myDelayTime;             // Время, до которого блокируется система. Блокируется "до" ВКЛЮЧИТЕЛЬНО,
                                    // т.е. до эотого момента времени не может появится новый объект АСП

public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactFireDelay(double inDelayTime);

    // Деструктор класса
    virtual ~CImpactFireDelay();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    double getDelayTime() const;


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif
