// Файл 10_CImpactFireDelay.cpp
// Воздействие "Команда блокировки системы пуска"
//

//=====================================================================================================================
// Заголовочные файлы
#include "10_CImpactFireDelay.h"




//=====================================================================================================================
// Конструктор класса
CImpactFireDelay::CImpactFireDelay(double inDelayTime)
    :myDelayTime(inDelayTime)
{
}




//=====================================================================================================================
// Деструктор класса
CImpactFireDelay::~CImpactFireDelay()
{
}




//=====================================================================================================================
// Доступ к параметрам воздействия
double CImpactFireDelay::getDelayTime() const
{
    return myDelayTime;
}


