// Файл 11_CImpactTargetMiss.h
// Воздействие "Промах по цели"
//

#ifndef Core_DataExchange_CImpactTargetMiss_h
#define Core_DataExchange_CImpactTargetMiss_h




//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"




//=====================================================================================================================
// Воздействие "Промах по цели"
class CImpactTargetMiss : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myTargetAbsNum;        // Глобальный номер цели


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactTargetMiss(size_t targetAbsNum);

    // Деструктор класса
    virtual ~CImpactTargetMiss();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getAbsNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif
