// Файл 11_CImpactTargetMiss.cpp
// Воздействие "Промах по цели"
//

// Заголовочные файлы
#include "11_CImpactTargetMiss.h"




//=====================================================================================================================
// Конструктор класса
CImpactTargetMiss::CImpactTargetMiss(size_t targetAbsNum)
{
    myTargetAbsNum = targetAbsNum;
}




//=====================================================================================================================
// Деструктор класса
CImpactTargetMiss::~CImpactTargetMiss()
{
}




//=====================================================================================================================
// Доступ к параметрам воздействия
size_t CImpactTargetMiss::getAbsNum() const
{
    return myTargetAbsNum;
}


