// Файл 12_CImpactTargetRefuse.h
// Воздействие "Отказ от целеуказания"
//

#ifndef Core_DataExchange_CImpactTargetRefuse_h
#define Core_DataExchange_CImpactTargetRefuse_h




//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"




//=====================================================================================================================
// Воздействие "Отказ от целеуказания"
class CImpactTargetRefuse : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myTargetAbsNum;        // Глобальный номер цели


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactTargetRefuse(size_t targetAbsNum);

    // Деструктор класса
    virtual ~CImpactTargetRefuse();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getAbsNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif
