// Файл 15_CImpactAttackAllarm.cpp
// Оповещение цели о пуске ракеты. Оповещение осуществляет система пуска
//

//=====================================================================================================================
// Заголовочные файлы
#include "15_CImpactAttackAllarm.h"




//=====================================================================================================================
// Конструктор класса
CImpactAttackAllarm::CImpactAttackAllarm(size_t weaponAbsNum, size_t aircraftNum)
{
    myWeaponAbsNum = weaponAbsNum;
    myAircraftNum = aircraftNum;
}




//=====================================================================================================================
// Деструктор класса
CImpactAttackAllarm::~CImpactAttackAllarm()
{
}




//=====================================================================================================================
// Доступ к параметрам воздействия
size_t CImpactAttackAllarm::getWeaponAbsNum() const
{
    return myWeaponAbsNum;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ к параметрам воздействия
size_t CImpactAttackAllarm::getAircraftNum() const
{
    return myAircraftNum;
}



