// Файл 15_CImpactAttackAllarm.h
// Оповещение цели о пуске ракеты. Оповещение осуществляет система пуска
//

#ifndef Core_DataExchange_CImpactAttackAllarm_h
#define Core_DataExchange_CImpactAttackAllarm_h




//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../01_CImpact.h"



// ВНИМАНИЕ!!!
// Импакт для отладки алгоритмов Васи:
// 1) алгоритм оценки возможности уклонения

//=====================================================================================================================
// Оповещение цели о пуске ракеты. Оповещение осуществляет система пуска
class CImpactAttackAllarm : public CImpact
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myWeaponAbsNum;              // Глобальный номер применяемого АСП
    size_t myAircraftNum;               // Глобальный номер носителя, применяющего оружие


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CImpactAttackAllarm(size_t weaponAbsNum, size_t aircraftNum);

    // Деструктор класса
    virtual ~CImpactAttackAllarm();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам воздействия
    size_t getWeaponAbsNum() const;
    size_t getAircraftNum() const;


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif


