// Файл FrontEnd.h
// Точка подключения всех возможностей блока 020_Math
//

#ifndef Math_FrontEnd_h
#define Math_FrontEnd_h




//=====================================================================================================================
// Общая алгебра
#include "01_Algebra/01_CEquationQuadratic.h"
#include "01_Algebra/02_CEquationCubic.h"
#include "01_Algebra/03_CEquationQuartic.h"




//=====================================================================================================================
// Численные методы
#include "02_Calculus/01_CInterpolator.h"
#include "02_Calculus/02_CTableFunction.h"




//=====================================================================================================================
// Геометрия в пространстве
#include "03_Geometry/01_CVector3D.h"
#include "03_Geometry/02_CPoint3D.h"
#include "03_Geometry/03_CLine3D.h"
#include "03_Geometry/04_CSphere3D.h"




//=====================================================================================================================
// Подключение файла статической библиотеки при компиляции
#if !defined(USED_CMAKE_BUILD_TOOL)   &&   defined(COMPILER_MICROSOFT)
__pragma(comment(lib, "020_Math"))
#endif




//=====================================================================================================================
#endif
