// Файл 01_CTaskPoint.h
// Положение моделируемого объекта в сценарии боевых действий
//

#ifndef Core_TaskReader_CTaskPoint_h
#define Core_TaskReader_CTaskPoint_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../01_CoordSystems/02_CPointGlobal.h"
#include "../01_CoordSystems/03_CPointGeo.h"


//=====================================================================================================================
// Положение моделируемого объекта в сценарии боевых действий
class CTaskPoint
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    CPointGlobal myPointGlobal;         // Положение объекта в геоцентрической декартовой СК
    CPointGeo myPointGeo;               // Положение объекта в геодезической сферической СК


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CTaskPoint();
    explicit CTaskPoint(const CPointGlobal &pointGlobal);
    explicit CTaskPoint(const CPointGeo &pointGeo);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к положению объекта в геоцентрической декартовой СК
    const CPointGlobal & getPointGlobal() const;
    CPointGlobal & getPointGlobal();

    // Доступ к положению объекта в геодезической сферической СК
    const CPointGeo & getPointGeo() const;
    CPointGeo & getPointGeo();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Оператор ранжирования двух положений во времени
    bool operator <(const CTaskPoint &other) const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


