// Файл 01_CTaskPoint.cpp
// Положение моделируемого объекта в сценарии боевых действий
//

//=====================================================================================================================
// Заголовочные файлы
#include "01_CTaskPoint.h"




//=====================================================================================================================
// Конструктор класса
CTaskPoint::CTaskPoint()
{
}




//---------------------------------------------------------------------------------------------------------------------
// Конструктор класса
CTaskPoint::CTaskPoint(const CPointGlobal &pointGlobal)
{
    myPointGlobal = pointGlobal;
    myPointGeo = myPointGlobal.toPointGeo();
}




//---------------------------------------------------------------------------------------------------------------------
// Конструктор класса
CTaskPoint::CTaskPoint(const CPointGeo &pointGeo)
{
    myPointGeo = pointGeo;
    myPointGlobal = myPointGeo.toPointGlobal();
}




//=====================================================================================================================
// Доступ к положению объекта в геоцентрической декартовой СК
const CPointGlobal & CTaskPoint::getPointGlobal() const
{
    return myPointGlobal;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ к положению объекта в геоцентрической декартовой СК
CPointGlobal & CTaskPoint::getPointGlobal()
{
    return myPointGlobal;
}




//=====================================================================================================================
// Доступ к положению объекта в геодезической сферической СК
const CPointGeo & CTaskPoint::getPointGeo() const
{
    return myPointGeo;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ к положению объекта в геодезической сферической СК
CPointGeo & CTaskPoint::getPointGeo()
{
    return myPointGeo;
}




//=====================================================================================================================
// Оператор ранжирования двух положений во времени
bool CTaskPoint::operator <(const CTaskPoint &other) const
{
    return checkLT(myPointGlobal.getTime(), other.myPointGlobal.getTime());
}

