// Файл 02_CTaskCmd.cpp
// Команда моделируемому объекту в сценарии боевых действий
//

//=====================================================================================================================
// Заголовочные файлы
#include "02_CTaskCmd.h"




//=====================================================================================================================
// Единственный на всю программу технологический экземпляр пустого значения параметра
string CTaskCmd::myEmptyParam;




//=====================================================================================================================
// Конструктор класса
CTaskCmd::CTaskCmd()
{
    myTime = 0.0;
}




//---------------------------------------------------------------------------------------------------------------------
// Конструктор класса
CTaskCmd::CTaskCmd(double time, const string &name)
{
    myTime = time;
    myName = name;
}




//---------------------------------------------------------------------------------------------------------------------
// Конструктор класса
CTaskCmd::CTaskCmd(double time, const string &name, const vector<string> &paramList)
{
    myTime = time;
    myName = name;
    if (paramList.empty() == false)
        myParamList = paramList;
}




//=====================================================================================================================
// Доступ информации о команде
double CTaskCmd::getTime() const
{
    return myTime;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ информации о команде
const string & CTaskCmd::getName() const
{
    return myName;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ информации о команде
size_t CTaskCmd::getParamCount() const
{
    return myParamList.size();
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ информации о команде
const string & CTaskCmd::getParam(size_t index) const
{
    // Если индекс некорректный
    if (index >= myParamList.size())
    {
        ErrorCode = ERR_BAD_INDEX;
        return myEmptyParam;
    }

    // Выдача результата
    ErrorCode = ERR_OK;
    return myParamList[index];
}




//=====================================================================================================================
// Оператор ранжирования двух команд во времени
bool CTaskCmd::operator <(const CTaskCmd &other) const
{
    return checkLT(myTime, other.myTime);
}


