// Файл 02_CTaskCmd.h
// Команда моделируемому объекту в сценарии боевых действий
//

#ifndef Core_TaskReader_CTaskCmd_h
#define Core_TaskReader_CTaskCmd_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"


//=====================================================================================================================
// Команда моделируемому объекту в сценарии боевых действий
class CTaskCmd
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    // Единственный на всю программу технологический экземпляр пустого значения параметра
    static string myEmptyParam;


private:
    //-----------------------------------------------------------------------------------------------------------------
    double myTime;                  // Момент времени, к которому приязана команда
    string myName;                  // Имя команды
    vector<string> myParamList;     // Список параметров команды


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CTaskCmd();
    CTaskCmd(double time, const string &name);
    CTaskCmd(double time, const string &name, const vector<string> &paramList);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ информации о команде
    double getTime() const;
    const string & getName() const;

    size_t getParamCount() const;
    const string & getParam(size_t index) const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Оператор ранжирования двух команд во времени
    bool operator <(const CTaskCmd &other) const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


