// Файл 20_CTaskRouteFlight.h
// Данные о маршруте полёта
//

#ifndef Core_TaskReader_CTaskRouteFlight_h
#define Core_TaskReader_CTaskRouteFlight_h




//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "01_CTaskPoint.h"




//=====================================================================================================================
// Данные о маршруте полёта в сценарии боевых действий
class CTaskRouteFlight
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    static CTaskPoint myEmptyPoint;     // Единственный на всю программу технологический экземпляр пустой точки


private:
    //-----------------------------------------------------------------------------------------------------------------
    string mySceneName;         // Имя сценария, откуда взят маршрут
    uint32 mySceneNum;          // Номер элемента, описывающего маршрут, в сценарии
    string myName;              // Обозначение маршрута в виртуальном Мире, по которому на него можно ссылаться
    bool myIsRed;               // Признак принадлежности к "Красным"


private:
    //-----------------------------------------------------------------------------------------------------------------
    vector<CTaskPoint> myPointList;     // Список опорных точек


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CTaskRouteFlight(const string &name, const vector<CTaskPoint> &pointList, bool isRed);
    CTaskRouteFlight(const string &sceneName, uint32 sceneNum, const string &name, const vector<CTaskPoint> &pointList, bool isRed);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ информации о маршруте
    const string & getSceneName() const;
    uint32 getSceneNum() const;
    const string & getName() const;
    bool isRed() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к опорным точкам маршрута
    size_t getPointCount() const;
    const CTaskPoint & getPoint(size_t index) const;


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif


