// Файл 30_CTaskZonePatrol.h
// Данные о зоне барражирования
//

#ifndef Core_TaskReader_CTaskZonePatrol_h
#define Core_TaskReader_CTaskZonePatrol_h




//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "01_CTaskPoint.h"




//=====================================================================================================================
// Данные о зоне барражирования в сценарии боевых действий
class CTaskZonePatrol
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    static CTaskPoint myEmptyPoint;     // Единственный на всю программу технологический экземпляр пустой точки


private:
    //-----------------------------------------------------------------------------------------------------------------
    string mySceneName;         // Имя сценария, откуда взята зона
    uint32 mySceneNum;          // Номер элемента, описывающего зону, в сценарии
    string myName;              // Обозначение зоны в виртуальном мире, по которому на неё можно ссылаться
    bool myIsRed;               // Признак принадлежности к "Красным"


private:
    //-----------------------------------------------------------------------------------------------------------------
    vector<CTaskPoint> myPointList;     // Список опорных точек


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CTaskZonePatrol(const string &name, const vector<CTaskPoint> &pointList, bool isRed);
    CTaskZonePatrol(const string &sceneName, uint32 sceneNum, const string &name, const vector<CTaskPoint> &pointList, bool isRed);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ информации о зоне
    const string & getSceneName() const;
    uint32 getSceneNum() const;
    const string & getName() const;
    bool isRed() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к опорным точкам зоны
    size_t getPointCount() const;
    const CTaskPoint & getPoint(size_t index) const;


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif


