// Файл 40_CTaskMsg.h
// Сообщение из задачи моделирования
//

#ifndef Core_TaskReader_CTaskMsg_h
#define Core_TaskReader_CTaskMsg_h




//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"




//=====================================================================================================================
// Сообщение из задачи моделирования
class CTaskMsg
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Типы сообщений
    enum msgType
    {
        MSG_OBJECT_EMPTY = 0,       // Пустое сообщение
        MSG_OBJECT_APPEAR,          // Появление объекта (первая точка маршрута)
        MSG_OBJECT_ROUTE_END,       // Конец маршрута (последняя точка маршрута)
        MSG_OBJECT_POINT,           // Очередная точка маршрута
        MSG_OBJECT_CMD              // Команда объекту
    };


private:
    //-----------------------------------------------------------------------------------------------------------------
    double myTime;              // Момент времени, к которому привязано сообщение
    msgType myType;             // Тип сообщения
    size_t myObjectIndex;       // Индекс объекта, к которому привязано сообщение
    size_t myPointCmdIndex;     // Индекс точки или команды, к которой привязано сообщение


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CTaskMsg(double time, msgType type, size_t objectIndex, size_t pointCmdIndex);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам сообщения
    double getTime() const;
    msgType getType() const;
    size_t getObjectIndex() const;
    size_t getPointCmdIndex() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Оператор ранжирования двух сообщений во времени
    bool operator <(const CTaskMsg &other) const;


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif


