// Файл 41_CTaskMsgQueue.h
// Очередь сообщений из задачи моделирования
//

#ifndef Core_TaskReader_CTaskMsgQueue_h
#define Core_TaskReader_CTaskMsgQueue_h




//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "40_CTaskMsg.h"




//=====================================================================================================================
// Очередь сообщений из задачи моделирования
class CTaskMsgQueue
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    // Единственное на всю программу пустое сообщение
    static CTaskMsg myEmptyMsg;


private:
    //-----------------------------------------------------------------------------------------------------------------
    vector<CTaskMsg> myMsgQueue;        // Очередь сообщений
    size_t myCurMsgIndex;               // Индекс текущего сообщения



public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CTaskMsgQueue();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к состоянию очереди сообщений
    const CTaskMsg & peekMsg() const;
    const CTaskMsg & popMsg();
    bool isEmpty() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Заполнение очереди сообщений
    void pushMsg(const CTaskMsg &msg);
    void sort();


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif


