// Файл 50_CTask.h
// Описание задачи моделирования
//

#ifndef Core_TaskReader_CTask_h
#define Core_TaskReader_CTask_h




//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "03_CTaskObject.h"
#include "20_CTaskRouteFlight.h"
#include "30_CTaskZonePatrol.h"
#include "41_CTaskMsgQueue.h"




//=====================================================================================================================
// Описание задачи моделирования
class CTask
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единое на всю программу глобальное описание задачи моделирования
    static CTask myGlobalTask;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Технологический экземпляр пустого объекта в сценарии
    CTaskObject myEmptyObject;

    // Технологический экземпляр пустого маршрута полёта в сценарии
    CTaskRouteFlight myEmptyRouteFlight;

    // Технологический экземпляр пустой зоны барражирования в сценарии
    CTaskZonePatrol myEmptyZonePatrol;


private:
    //-----------------------------------------------------------------------------------------------------------------
    string myName;                                  // Имя задачи моделирования
    vector<CTaskObject> myObjectList;               // Список моделируемых объектов в задаче моделирования
    vector<CTaskRouteFlight> myRouteFlightList;     // Список маршрутов полёта в задаче моделирования
    vector<CTaskZonePatrol> myZonePatrolList;       // Список зон барражирования в задаче моделирования
    CTaskMsgQueue myMsgQueue;                       // Очередь сообщений


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CTask();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Загрузка описания задачи моделирования
    bool load(const string &taskFileName);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к имени задачи моделирования
    const string & getName() const;

    // Доступ к описанию моделируемых объектов
    size_t getObjectCount() const;
    const CTaskObject & getObject(size_t index) const;

    // Доступ к описанию маршрутов полёта
    size_t getRouteFlightCount() const;
    const CTaskRouteFlight & getRouteFlight(size_t index) const;

    // Доступ к описанию зон барражирования
    size_t getZonePatrolCount() const;
    const CTaskZonePatrol & getZonePatrol(size_t index) const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к очереди сообщений
    const CTaskMsg & peekMsg() const;
    const CTaskMsg & popMsg();
    bool isQueueEmpty() const;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Вспомогательные методы
    static vector<string> _extractSceneFileList(const CDataMap &data, bool isRed);
    result _loadScene(const string &fileName, bool isRed);


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
// Быстрый доступ к описанию задачи
static CTask &Task = CTask::myGlobalTask;




//=====================================================================================================================
#endif


