// Файл 01_CSysMotionMissileSimpleType.cpp
// Описание нового типа функциональных систем движения
//

//=====================================================================================================================
// Заголовочные файлы
#include "01_CSysMotionMissileSimpleType.h"
#include "02_CSysMotionMissileSimple.h"




//=====================================================================================================================
// Конструктор класса
CSysMotionMissileSimpleType::CSysMotionMissileSimpleType()
{
    // Указание начальных значений параметров
    myVelocity = 1000.;
    myExplosionRadius = 100;
    myMissileName = "";


    // Замечание 1
    // Значение параметра myParamOne явно указывается, потому что это переменная
    // простого встроенного типа. По умолчанию, начальное значение ей не присваивается

    // Замечание 2
    // Значение параметра myParamTwo не указывается, потому это переменная типа string.
    // Конструктор класса string автоматически присвоит этой переменной начальное значение
}




//=====================================================================================================================
// Деструктор класса
CSysMotionMissileSimpleType::~CSysMotionMissileSimpleType()
{
}




//=====================================================================================================================
// Загрузка информации о типе системы из текстового файла
result CSysMotionMissileSimpleType::load(const CDataMap &data, const string &fileName)
{
    // Признак наличия предупреждений при считывании параметров типа системы
    bool wereWarnings = false;      // изначально полагаем, что предупреждений не будет

    // Считывание общей информации, присутствущей в любом файле с описанием типа системы
    if (CSysType::load(data, fileName) == RESULT_ERROR)
        return RESULT_ERROR;

    // Считывание значения первого нового параметра (это обязательный параметр)
    if (extractDoublePositive(data, fileName, "/средняя_скорость_ракеты", myVelocity, false,
        "поле \"средняя_скорость_ракеты\" не найдено!",
        "в поле \"средняя_скорость_ракеты\" не указано значение!",
        "в поле \"средняя_скорость_ракеты\" допустимо только положительное значение!") == false)
        return RESULT_ERROR;

	// Считывание значения первого нового параметра (это обязательный параметр)
	if (extractDoublePositive(data, fileName, "/сектор_подрыва", myExplosionRadius, false,
		"поле \"сектор_подрыва\" не найдено!",
		"в поле \"сектор_подрыва\" не указано значение!",
		"в поле \"сектор_подрыва\" допустимо только положительное значение!") == false)

    // Считывание значения первого нового параметра (это необязательный параметр)
    if (extractString(data, fileName, "/название_оружия", myMissileName, false,
        "поле \"название_оружия\" не найдено!",
        "в поле \"название_оружия\" не указано значение!",
        "в поле \"название_оружия\" указано пустое значение!") == false)
        wereWarnings = true;

    // Считывание параметров завершено
    if (wereWarnings == true)
        return RESULT_WARNING;
    return RESULT_OK;
}




//=====================================================================================================================
// Создание экземпляра системы данного типа
CSys * CSysMotionMissileSimpleType::createSystem(CObject &object) const
{
    return new CSysMotionMissileSimple(*this, object);
}




//=====================================================================================================================
// Доступ к характеристикам типа систем
double CSysMotionMissileSimpleType::getVelocity() const
{
    return myVelocity;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ к характеристикам типа систем
double CSysMotionMissileSimpleType::getExplosionRadius() const
{
    return myExplosionRadius;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ к характеристикам типа систем
const string & CSysMotionMissileSimpleType::getMissileName() const
{
    return myMissileName;
}



