// Файл 01_CSysMotionMissileSimpleType.h
// Описание нового типа функциональных систем движения
//

#ifndef _330_MotionMissileSimple_System_CSysMotionNewType_h
#define _330_MotionMissileSimple_System_CSysMotionNewType_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"


//=====================================================================================================================
// Описание нового типа функциональных систем движения
class CSysMotionMissileSimpleType: public CSysMotionType
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    double myVelocity;              // Средняя скорость ракеты
    double myExplosionRadius;       // Сектор подрыва
    string myMissileName;           // Название ракеты


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CSysMotionMissileSimpleType();

    // Деструктор класса
    virtual ~CSysMotionMissileSimpleType();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Загрузка информации о типе систем из текстового файла
    virtual result load(const CDataMap &data, const string &fileName);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Создание экземпляра системы данного типа
    virtual CSys * createSystem(CObject &object) const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к характеристикам типа систем
    double getVelocity() const;
    double getExplosionRadius() const;
    const string & getMissileName() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


