// Файл 04_DetectCompiler.h
// Определение типа используемого компилятора
//

#ifndef Kernel_Environment_DetectCompiler_h
#define Kernel_Environment_DetectCompiler_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "01_StdLib.h"


//=====================================================================================================================
// Определение типа используемого компилятора
#if defined(_MSC_VER)
    #define COMPILER_MICROSOFT


//---------------------------------------------------------------------------------------------------------------------
#elif defined(__BORLANDC__)
    #define COMPILER_BORLAND


//---------------------------------------------------------------------------------------------------------------------
#elif defined(__WATCOMC__)
    #define COMPILER_WATCOM


//---------------------------------------------------------------------------------------------------------------------
#elif defined(__DMC__)
    #define COMPILER_DIGITAL


//---------------------------------------------------------------------------------------------------------------------
#elif defined(__GNUC__)
    #define COMPILER_GNU


//---------------------------------------------------------------------------------------------------------------------
#elif defined(__INTEL_COMPILER)
    #define COMPILER_INTEL


//---------------------------------------------------------------------------------------------------------------------
#elif defined(__clang__)
    #define COMPILER_CLANG


//---------------------------------------------------------------------------------------------------------------------
#else
    #define COMPILER_UNKNOWN
#endif


//=====================================================================================================================
// Intel C++ маскируется под Microsoft Visual C++
#if defined(COMPILER_MICROSOFT)   &&   defined(__INTEL_COMPILER)
    #define COMPILER_INTEL
#endif


//=====================================================================================================================
// Intel C++ маскируется под GNU C++
#if defined(COMPILER_GNU)   &&   defined(__INTEL_COMPILER)
    #define COMPILER_INTEL
#endif


//=====================================================================================================================
// clang маскируется под GNU C++
#if defined(COMPILER_GNU)   &&   defined(__clang__)
    #define COMPILER_CLANG
#endif


//=====================================================================================================================
// MinGW маскируется под GNU C++
#if defined(COMPILER_GNU)   &&   defined(__MINGW32__)
    #define COMPILER_MINGW
#endif


//=====================================================================================================================
#endif
