// Файл 02_FloatingTypes.cpp
// Обработка действительных чисел
//

//=====================================================================================================================
// Заголовочные файлы
#include "02_FloatingTypes.h"




//=====================================================================================================================
// Определение точности интервальной обработки действительных чисел
static double double_accuracy = 0.000001;




//=====================================================================================================================
// Проверка на нечисловое значение
bool checkNaN(double value)
{
    // Нечисло не равно ни какому числу, в том числе самому себе
    if (value == value)
        return false;
    return true;
}




//=====================================================================================================================
// Проверка на бесконечность (положительную или отрицательную)
bool checkInf(double value)
{
    // Бесконечность (и только она), умноженная на нуль, даст нечисловое значение
    double test = value * 0.0;
    if (test == test)
        return false;
    return true;
}




//=====================================================================================================================
// Проверка на "равно"
bool checkEQ(double left, double right)
{
    if (std::fabs(left - right) < double_accuracy)
        return true;
    return false;
}




//=====================================================================================================================
// Проверка на "не равно"
bool checkNE(double left, double right)
{
    return !checkEQ(left, right);
}




//=====================================================================================================================
// Проверка на "строго меньше"
bool checkLT(double left, double right)
{
    if (left   <   right - double_accuracy)
        return true;
    return false;
}




//=====================================================================================================================
// Проверка на "строго больше"
bool checkGT(double left, double right)
{
    if (left > right + double_accuracy)
        return true;
    return false;
}




//=====================================================================================================================
// Проверка на "меньше или равно"
bool checkLE(double left, double right)
{
    return !checkGT(left, right);
}




//---------------------------------------------------------------------------------------------------------------------
// Проверка на "меньше или равно"
bool checkNG(double left, double right)
{
    return !checkGT(left, right);
}




//=====================================================================================================================
// Проверка на "больше или равно"
bool checkGE(double left, double right)
{
    return !checkLT(left, right);
}




//---------------------------------------------------------------------------------------------------------------------
// Проверка на "больше или равно"
bool checkNL(double left, double right)
{
    return !checkLT(left, right);
}


