// Файл 03_AngleTransform.cpp
// Преобразование углов
//

//=====================================================================================================================
// Заголовочные файлы
#include "02_FloatingTypes.h"
#include "03_AngleTransform.h"




//=====================================================================================================================
// Перевод градусов в радианы
double deg2rad(double degrees)
{
    return degrees * (3.14159265358979323846 / 180.0);
}




//=====================================================================================================================
// Перевод радиан в градусы
double rad2deg(double radians)
{
    return radians * (180.0 / 3.14159265358979323846);
}




//=====================================================================================================================
// Объединение градусов, минут и секунд
double uniteDegrees(double degrees, double minutes, double seconds)
{
    return degrees + minutes/60.0 + seconds/3600.0;
}




//=====================================================================================================================
// Выделение градусов, минут и секунд
void expandDegrees(double source, double &degrees, double &minutes, double &seconds)
{
    // Выделить полные градусы
    double fraction = modf(source, &degrees);

    // Выделить минуты
    fraction = modf(fraction*60.0, &minutes);

    // Выделить секунды
    seconds = fraction*60.0;
}




//=====================================================================================================================
// Нормирование угла на диапазон от -180 до +180 градусов
double normalizeTo180(double degrees)
{
    while (checkLE(degrees, -180.0) == true)
        degrees += 360.0;

    while (checkGT(degrees, 180.0) == true)
        degrees -= 360.0;

    return degrees;
}




//=====================================================================================================================
// Нормирование угла на диапазон от 0 до 360 градусов
double normalizeTo360(double degrees)
{
    while (checkLE(degrees, 0.0) == true)
        degrees += 360.0;

    while (checkGT(degrees, 360.0) == true)
        degrees -= 360.0;

    return degrees;
}




//=====================================================================================================================
// Нормирование угла на диапазон от -Пи до +Пи радиан
double normalizeToPi(double radians)
{
    return deg2rad(normalizeTo180(rad2deg(radians)));
}




//=====================================================================================================================
// Нормирование угла на диапазон от 0 до 2Пи радиан
double normalizeTo2Pi(double radians)
{
    return deg2rad(normalizeTo360(rad2deg(radians)));
}


