// Файл 04_CByteArray.cpp
// Массив байтов
//

//=====================================================================================================================
// Заголовочные файлы
#include "04_CByteArray.h"




//=====================================================================================================================
// Конструктор
CByteArray::CByteArray()
{
    myData = NULL;
    mySize = 0;
}




//---------------------------------------------------------------------------------------------------------------------
// Конструктор
CByteArray::CByteArray(char *data, uint32 size)
{
    myData = data;
    mySize = size;
}




//=====================================================================================================================
// Деструктор
CByteArray::~CByteArray()
{
    myData = NULL;
    mySize = 0;
}




//=====================================================================================================================
// Доступ к содержимому массива
char * CByteArray::getData()
{
    return myData;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ к содержимому массива
const char * CByteArray::getData() const
{
    return myData;
}




//=====================================================================================================================
// Доступ к размеру массива
uint32 CByteArray::getSize() const
{
    return mySize;
}




//=====================================================================================================================
// Настройка массива на новый набор данных
void CByteArray::set(char *data, uint32 size)
{
    myData = data;
    mySize = size;
}




//=====================================================================================================================
// Выделение памяти для массива
bool CByteArray::alloc(uint32 size)
{
    char *data = (char *)malloc((size_t)size);
    if (data == NULL)
        return false;

    myData = data;
    mySize = size;
    return true;
}




//=====================================================================================================================
// Освобождение памяти из-под массива
void CByteArray::free()
{
    if (myData != NULL)
        std::free(myData);
    myData = NULL;
    mySize = 0;
}




//=====================================================================================================================
// Копирование массива
CByteArray CByteArray::clone() const
{
    CByteArray newArray;
    if (myData == NULL   ||   mySize == 0)
        return newArray;

    if (newArray.alloc(mySize) == false)
        return newArray;

    memcpy(newArray.myData, myData, mySize);
    return newArray;
}



