// Файл 04_CByteArray.h
// Массив байтов
//

#ifndef Kernel_BasicTypes_CByteArray_h
#define Kernel_BasicTypes_CByteArray_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../01_Environment/01_StdLib.h"
#include "../01_Environment/02_DetectSystem.h"
#include "../01_Environment/03_CheckSystem.h"
#include "../01_Environment/04_DetectCompiler.h"
#include "../01_Environment/05_CheckCompiler.h"
#include "../01_Environment/06_SysLib.h"
#include "01_IntegerTypes.h"


//=====================================================================================================================
// Массив байтов
class CByteArray
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    char *myData;
    uint32 mySize;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструкторы
    CByteArray();
    CByteArray(char *data, uint32 size);

    // Деструктор
    ~CByteArray();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к содержимому массива
    char * getData();
    const char * getData() const;
    uint32 getSize() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Работа с содержимым массива
    void set(char *data, uint32 size);
    bool alloc(uint32 size);
    void free();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Копирование массива
    CByteArray clone() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif

