// Файл 01_CFilm.h
// Генератор файла фильма
//

#ifndef Core_OutputWriter_CFilm_h
#define Core_OutputWriter_CFilm_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../01_CoordSystems/02_CPointGlobal.h"


//=====================================================================================================================
// Генератор файла фильма
class CFilm
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единый на всю программу глобальный генератор фильма
    static CFilm myGlobalFilm;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Виды объектов
    enum kind
    {
        AIR = 0,    // Воздушный
        GROUND,     // Наземный
        VIRTUAL     // Виртуальный
    };


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Состояния объекта
    enum state
    {
        ALIVE = 0,      // Существует
        KILLED,         // Поражён
        DEAD,            // Уничтожен
        DESTROY,        // Уничтожение объекта без убирания с карты
    };


private:
    //-----------------------------------------------------------------------------------------------------------------
    CTextFile myFile;           // Файл фильма
    uint32 myObjectCounter;     // Счётчик зарегистрированных объектов фильма

    uint32 myRedSceneId;        // Идентификатор сценария за "Красных"
    uint32 myBlueSceneId;       // Идентификатор сценария за "Синих"


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Таблица соответствий "номер в фильме - номер объекта"
    map<uint32, size_t> myFilmIdAbsNumMap;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CFilm();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Деструктор класса
    ~CFilm();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Начало записи фильма
    bool start(const string &fileName);

    // Конец записи фильма
    void stop();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к идентификаторам сценариев
    uint32 getRedSceneId() const;
    uint32 getBlueSceneId() const;

    // Регистрация объектов в фильме
    uint32 registerObject(size_t absNum, double time, const string &type, const string &name, uint32 parentId, kind objKind);

    // Запись координат объекта в фильм
    void writePoint(uint32 objId, double time, double x, double y, double z, double vx, double vy, double vz, double roll);
    void writePoint(uint32 objId, const CPointGlobal &point);

    // Запись состояния объекта в фильм
    void writeState(uint32 objId, double time, state objState);

    // Запись сообщения по объекту в фильм
    void writeLog(uint32 objId, double time, const string &text);

    // Запись текстовых данных в файл
    void writeText(const string& text);
   
    // Запись огня
    void writeFire(uint32 objId, double time, bool showFire);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
// Быстрый доступ к генератору фильма
static CFilm &Film = CFilm::myGlobalFilm;


//=====================================================================================================================
#endif


