///=====================================================================================================================
// Объект из сценария
//
#ifndef NObject_h
#define NObject_h

//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
//=====================================================================================================================
// Объект
class NObject
{
public:
	//-----------------------------------------------------------------------------------------------------------------
	uint32 myObjNum;                      // Номер объекта в фильме
	size_t myAbsNum;				 	  // Номер объекта в виртуальном Мире модели
	vector<CPointGlobal> myRoute;         // Маршрут движения (в геоцентрической декартовой СК)
	vector<CPointGeo>  myRouteGeo;        // Маршрут движения (в геодезической сферической СК)

	static CPointGlobal myEmptyPoint;
	static CPointGeo myEmptyPointGeo;

public:
	//-----------------------------------------------------------------------------------------------------------------
	// Доступ к номеру объекта
	uint32 getObjNum() const;

	// Доступ к точкам маршрута в геоцентрической декартовой СК
	size_t getPointCount() const;
	const CPointGlobal& getPoint(size_t index) const;

	// Доступ к точкам маршрута в геодезической сферической СК
	size_t getPointGeoCount() const;
	const CPointGeo& getPointGeo(size_t index) const;

	//-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif