#ifndef Trajectory_BpLA_h
#define Trajectory_BpLA_h

//=====================================================================================================================
// Заголовочные файлы

struct MyTrajectoryBpLA
{
	double time = -1;     // Текущий момент времени
	double x;             // Координата х БпЛА в геоцентрической СК
	double y;             // Координата y БпЛА в геоцентрической СК
	double z;             // Координата z БпЛА в геоцентрической СК
	double vx;            // Составляющая вектора скорости БпЛА по оси х
	double vy;            // Составляющая вектора скорости БпЛА по оси y
	double vz;            // Составляющая вектора скорости БпЛА по оси z
	double fi;            // Угол поворота траектории БпЛА
	double teta;          // Угол наклона траектории БпЛА
	double gamma;         // Угол крена БпЛА 
};

//=====================================================================================================================
#endif
