// Файл 02_CRequest.cpp
// Базовый класс для создания запросов
//

//=====================================================================================================================
// Заголовочные файлы
#include "02_CRequest.h"




//=====================================================================================================================
// Конструктор класса
CRequest::CRequest()
{
    myIsCorrect = false;        // Изначально ответ считаем некорректным
}




//=====================================================================================================================
// Деструктор класса
CRequest::~CRequest()
{
}




//=====================================================================================================================
// Подтверждение ответа
void CRequest::acknowledge()
{
    myIsCorrect = true;
}




//=====================================================================================================================
// Отказ от ответа
void CRequest::discard()
{
    myIsCorrect = false;
}




//=====================================================================================================================
// Доступ к признаку корректности ответа
bool CRequest::isCorrect() const
{
    return myIsCorrect;
}
