// Файл 02_CRequest.h
// Базовый класс для создания запросов
//

#ifndef Core_DataExchange_CRequest_h
#define Core_DataExchange_CRequest_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"


//=====================================================================================================================
// Базовый класс для создания запросов
class CRequest
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    bool myIsCorrect;           // Признак корректности ответа на запрос


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CRequest();

    // Деструктор класса
    virtual ~CRequest() = 0;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Подтверждение ответа
    void acknowledge();

    // Отказ от ответа
    void discard();

    // Доступ к признаку корректности ответа
    bool isCorrect() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


