// Файл Wide.cpp
// Преобразование кодировки символов между CP-1251 и WideChar
//

//=====================================================================================================================
// Заголовочные файлы
#include "Wide.h"




//=====================================================================================================================
// Массивы перекодируемых символов
static char    alpha[]  = {   32,   65,   66,   67,   68,   69,   70,   71,   72,   73,   74,   75,   76,   77,   78,   79,   80,   81,   82,   83,   84,   85,   86,   87,   88,   89,   90,   97,   98,   99,  100,  101,  102,  103,  104,  105,  106,  107,  108,  109,  110,  111,  112,  113,  114,  115,  116,  117,  118,  119,  120,  121,  122,  -64,  -63,  -62,  -61,  -60,  -59,  -88,  -58,  -57,  -56,  -55,  -54,  -53,  -52,  -51,  -50,  -49,  -48,  -47,  -46,  -45,  -44,  -43,  -42,  -41,  -40,  -39,  -38,  -37,  -36,  -35,  -34,  -33,  -32,  -31,  -30,  -29,  -28,  -27,  -72,  -26,  -25,  -24,  -23,  -22,  -21,  -20,  -19,  -18,  -17,  -16,  -15,  -14,  -13,  -12,  -11,  -10,   -9,   -8,   -7,   -6,   -5,   -4,   -3,   -2,   -1,   48,   49,   50,   51,   52,   53,   54,   55,   56,   57,   45,   61,   33,   64,   35,   36,   37,   94,   38,   42,   40,   41,   95,   43,   44,   46,   47,   63,   60,   62,   91,   93,  123,  125,  124,   58,   59,   92,   34,   39,  126,   96 };
static wchar_t alphaW[] = {   32,   65,   66,   67,   68,   69,   70,   71,   72,   73,   74,   75,   76,   77,   78,   79,   80,   81,   82,   83,   84,   85,   86,   87,   88,   89,   90,   97,   98,   99,  100,  101,  102,  103,  104,  105,  106,  107,  108,  109,  110,  111,  112,  113,  114,  115,  116,  117,  118,  119,  120,  121,  122, 1040, 1041, 1042, 1043, 1044, 1045, 1025, 1046, 1047, 1048, 1049, 1050, 1051, 1052, 1053, 1054, 1055, 1056, 1057, 1058, 1059, 1060, 1061, 1062, 1063, 1064, 1065, 1066, 1067, 1068, 1069, 1070, 1071, 1072, 1073, 1074, 1075, 1076, 1077, 1105, 1078, 1079, 1080, 1081, 1082, 1083, 1084, 1085, 1086, 1087, 1088, 1089, 1090, 1091, 1092, 1093, 1094, 1095, 1096, 1097, 1098, 1099, 1100, 1101, 1102, 1103,   48,   49,   50,   51,   52,   53,   54,   55,   56,   57,   45,   61,   33,   64,   35,   36,   37,   94,   38,   42,   40,   41,   95,   43,   44,   46,   47,   63,   60,   62,   91,   93,  123,  125,  124,   58,   59,   92,   34,   39,  126,   96 };




//=====================================================================================================================
// Поиск символа CP-1251
static size_t _find1251(char sym)
{
    for (size_t i = 0; i < sizeof(alpha) / sizeof(alpha[0]); ++i)
        if (alpha[i] == sym)
            return i;
    return string::npos;
}




//=====================================================================================================================
// Поиск символа Unicode
static size_t _findUnicode(wchar_t sym)
{
    for (size_t i = 0; i < sizeof(alphaW) / sizeof(alphaW[0]); ++i)
        if (alphaW[i] == sym)
            return i;
    return string::npos;
}




//=====================================================================================================================
// Преобразование текстовой строки из кодировки CP-1251 (кириллица Windows) в кодировку Unicode (зависит от ОС)
wstring toWide(const string &str)
{
    wstring result;
    if (str.empty() == true)
        return result;

    // Последовательное преобразование символов из строки
    result.resize(str.size());
    for (size_t i = 0; i < str.size(); ++i)
    {
        // Поиск символа в списке преобразуемых
        size_t index = _find1251(str[i]);
        if (index == string::npos)
            result[i] = L' ';
        else
            result[i] = alphaW[index];
    }

    return result;
}




//=====================================================================================================================
// Преобразование текстовой строки из кодировки Unicode (зависит от ОС) в кодировку CP-1251 (кириллица Windows)
string fromWide(const wstring &str)
{
    string result;
    if (str.empty() == true)
        return result;

    // Последовательное преобразование символов из строки
    result.resize(str.size());
    for (size_t i = 0; i < str.size(); ++i)
    {
        // Поиск символа в списке преобразуемых
        size_t index = _findUnicode(str[i]);
        if (index == string::npos)
            result[i] = ' ';
        else
            result[i] = alpha[index];
    }

    return result;
}

