#ifndef _570_NavedenieNPC_FrontEnd_h
#define _570_NavedenieNPC_FrontEnd_h




//=====================================================================================================================
// Сюда надо подключать заголовочные файлы данного проекта
#include "Settings.h"




//=====================================================================================================================
// Описание новой системы и её типа
#include "90_System/01_CSysMotionNavedenieNPCType.h"
#include "90_System/02_CSysMotionNavedenieNPC.h"




//=====================================================================================================================
// Подключение файла статической библиотеки при компиляции
#if !defined(USED_CMAKE_BUILD_TOOL)   &&   defined(COMPILER_MICROSOFT)
__pragma(comment(lib, "570_NavedenieNPC"))
#endif




//=====================================================================================================================
#endif
