#ifndef _570_NavedenieNPC_System_CSysMotionNavedenieNPCType_h
#define _570_NavedenieNPC_System_CSysMotionNavedenieNPCType_h



//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../FD_BpLA/TTX_BpLA.h"


//=====================================================================================================================
// Описание нового типа функциональных систем движения
class CSysMotionNavedenieNPCType: public CSysMotionType
{

public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CSysMotionNavedenieNPCType();
	TTX_BpLA TX_bpla;

    // Деструктор класса
    virtual ~CSysMotionNavedenieNPCType();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Загрузка информации о типе систем из текстового файла
    virtual result load(const CDataMap &data, const string &fileName);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Создание экземпляра системы данного типа
    virtual CSys * createSystem(CObject &object) const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


