// Файл 01_CDateTime.h
// Доступ к системному времени
//

#ifndef Kernel_System_CDateTime_h
#define Kernel_System_CDateTime_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../01_Environment/01_StdLib.h"
#include "../01_Environment/02_DetectSystem.h"
#include "../01_Environment/03_CheckSystem.h"
#include "../01_Environment/04_DetectCompiler.h"
#include "../01_Environment/05_CheckCompiler.h"
#include "../01_Environment/06_SysLib.h"
#include "../02_BasicTypes/01_IntegerTypes.h"


//=====================================================================================================================
// Доступ к системному времени
class CDateTime
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    tm myTimeInfo;                      // Зафиксированный момент времени
    mutable string myDateString;        // Строка с датой
    mutable string myTimeString;        // Строка со временем


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Запрет создания, копирования и присваивания объектов пользователем
    CDateTime();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к текущей дате
    uint16 getYear() const;
    uint16 getMonth() const;
    uint16 getDay() const;

    // Доступ к текущему времени
    uint16 getHour() const;
    uint16 getMinute() const;
    uint16 getSecond() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Формирование строки с датой
    const string & getDateString() const;

    // Формирование строки со временем
    const string & getTimeString() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Получение значений от операционной системы
    static CDateTime querySystemTime();
    static CDateTime queryLocalTime();


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif

