// Файл 02_CFileInfo.h
// Информация о файле на диске
//

#ifndef Kernel_System_CFileInfo_h
#define Kernel_System_CFileInfo_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../01_Environment/01_StdLib.h"
#include "../01_Environment/02_DetectSystem.h"
#include "../01_Environment/03_CheckSystem.h"
#include "../01_Environment/04_DetectCompiler.h"
#include "../01_Environment/05_CheckCompiler.h"
#include "../01_Environment/06_SysLib.h"


//=====================================================================================================================
// Информация о файле на диске
class CFileInfo
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    string myFileName;      // Имя файла
    string myFilePath;      // Путь к файлу
    bool myIsDirectory;     // Признак каталога


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CFileInfo();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к информации о файле
    const string & getFileName() const;
    const string & getFilePath() const;
    bool isDirectory() const;


    //-----------------------------------------------------------------------------------------------------------------
    // Сбор информации о содержимом каталога
    static vector<CFileInfo> listDirectory(const string &path, const string &mask);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif

