// Файл 06_CClock.h
// Вычисление интервалов времени
//

#ifndef Kernel_System_Clock_h
#define Kernel_System_Clock_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../01_Environment/01_StdLib.h"
#include "../01_Environment/02_DetectSystem.h"
#include "../01_Environment/03_CheckSystem.h"
#include "../01_Environment/04_DetectCompiler.h"
#include "../01_Environment/05_CheckCompiler.h"
#include "../01_Environment/06_SysLib.h"
#include "../02_BasicTypes/01_IntegerTypes.h"


//=====================================================================================================================
// Метка времени
class CClock
{
private:
    //-----------------------------------------------------------------------------------------------------------------
#ifdef SYSTEM_WINDOWS
    LARGE_INTEGER li;
#else
    timeval tv;
#endif


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор (запрет явного создания)
    CClock();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Фиксация текущего момента времени
    static CClock now();

    // Вычисление времени, прошедшего с предыдущего момента
    uint32 passedFrom(const CClock &start) const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif
