// Файл 06_CClock.cpp
// Вычисление интервалов времени
//

//=====================================================================================================================
// Заголовочные файлы
#include "06_CClock.h"




//=====================================================================================================================
// Конструктор (запрет явного создания)
CClock::CClock()
{
}




//=====================================================================================================================
// Фиксация текущего момента времени
CClock CClock::now()
{
#ifdef SYSTEM_WINDOWS
    // Запрос значения системного таймера (количество шагов от момента запуска программы)
    CClock result;
    QueryPerformanceCounter(&result.li);
    return result;
#else
    // Запрос значения системного таймера (количество шагов от момента запуска программы)
    CClock result;
    gettimeofday(&result.tv, NULL);
    return result;
#endif
}




//=====================================================================================================================
// Вычисление времени, прошедшего с предыдущего момента
uint32 CClock::passedFrom(const CClock &start) const
{
    double result = 0.0;

#ifdef SYSTEM_WINDOWS
    // Запрос частоты работы системного таймера (количество шагов в секунду)
    LARGE_INTEGER frequency;
    QueryPerformanceFrequency(&frequency);

    // Вычисление прошедшего времени
    result = (this->li.QuadPart - start.li.QuadPart) * 1000.0 / frequency.QuadPart;
#else
    // Вычисление прошедшего времени
    result = (this->tv.tv_sec - start.tv.tv_sec) * 1000.0;         // секунды в миллисекунды
    result += (this->tv.tv_usec - start.tv.tv_usec) / 1000.0;      // микросекунды в миллисекунды
#endif
    if (result < 0.0)
        result = -result;
    return (uint32)result;
}


