// Файл 02_CTextLexeme.h
// Описание лексемы в текстовых данных
//

#ifndef Kernel_Parser_CTextLexeme_h
#define Kernel_Parser_CTextLexeme_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../01_Environment/01_StdLib.h"
#include "../01_Environment/02_DetectSystem.h"
#include "../01_Environment/03_CheckSystem.h"
#include "../01_Environment/04_DetectCompiler.h"
#include "../01_Environment/05_CheckCompiler.h"
#include "../01_Environment/06_SysLib.h"


//=====================================================================================================================
// Описание лексемы в текстовых данных
class CTextLexeme
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Перечень возможных типов лексем
    enum type
    {
        IDENTIFIER = 0,     // Идентификатор
        GROUP_BRACKET,      // Начало группы
        TABLE_BRACKET,      // Начало таблицы
        CLOSE_BRACKET,      // Конец группы или таблицы
        STRING_VALUE,       // Строковое значение
        NUMBER_VALUE,       // Числовое значение
        ASSIGNMENT,         // Присваивание
        END_OF_LINE,        // Конец строки в таблице
        END_OF_TEXT,        // Конец текста
        UNKNOWN             // Неизвестная лексема (ошибка)
    };


public:
    //-----------------------------------------------------------------------------------------------------------------
    type myType;        // Тип лексемы
    string myValue;     // Значение лексемы
    size_t myLine;      // Номер строки, на которой начинается лексема
    size_t myColumn;    // Номер столбца, в котором начинается лексема


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CTextLexeme();
    CTextLexeme(type t, const string &value, size_t line, size_t column);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif

