// Файл 02_CTextLexeme.cpp
// Описание лексемы в текстовых данных
//

//=====================================================================================================================
// Заголовочные файлы
#include "02_CTextLexeme.h"




//=====================================================================================================================
// Конструктор класса
CTextLexeme::CTextLexeme()
{
    myType = UNKNOWN;
    myLine = 0;
    myColumn = 0;
}




//---------------------------------------------------------------------------------------------------------------------
// Конструктор класса
CTextLexeme::CTextLexeme(type t, const string &value, size_t line, size_t column)
{
    myType = t;
    myValue = value;
    myLine = line;
    myColumn = column;
}

