// Файл 03_CTextScanner.h
// Лексический препроцессор текстовых данных
//

#ifndef Kernel_Parser_CTextScanner_h
#define Kernel_Parser_CTextScanner_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../01_Environment/01_StdLib.h"
#include "../01_Environment/02_DetectSystem.h"
#include "../01_Environment/03_CheckSystem.h"
#include "../01_Environment/04_DetectCompiler.h"
#include "../01_Environment/05_CheckCompiler.h"
#include "../01_Environment/06_SysLib.h"
#include "02_CTextLexeme.h"


//=====================================================================================================================
// Лексический препроцессор текстовых данных
class CTextScanner
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    const string *myText;       // Обрабатываемый текст (указатель)
    size_t myOffset;            // Смещение текущей позиции в обрабатываемом тексте
    size_t myLineCounter;       // Счётчик прочитанных строк в тексте
    size_t myColumnCounter;     // Счётчик прочитанных столбцов в текущей строке


private:
    //-----------------------------------------------------------------------------------------------------------------
    bool myWasError;                // Признак ошибки
    size_t myErrorLine;             // Номер строки с ошибкой
    size_t myErrorColumn;           // Номер столбца, где находится ошибка
    size_t myErrorExtraColumn;      // Номер столбца, где начинается ошибочная лексема
    string myErrorMessage;          // Сообщение с описанием ошибки


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CTextScanner();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Инициализация сканера строкой текста
    void init(const string &text);

    // Чтение очередной лексемы из текста
    CTextLexeme read();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к информации об ошибках анализа
    bool wasError() const;
    size_t getErrorLine() const;
    size_t getErrorColumn() const;
    size_t getErrorExtraColumn() const;
    const string & getErrorMessage() const;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Чтение комментария
    bool _readComment();

    // Чтение идентификатора
    CTextLexeme _readIdentifier();

    // Чтение операторной скобки (начало таблицы, начало группы, конец группы или таблицы)
    CTextLexeme _readBracket();

    // Чтение числового значения
    CTextLexeme _readNumber();

    // Чтение строкового значения
    CTextLexeme _readString();

    // Чтение оператора присваивания
    CTextLexeme _readAssignment();

    // Чтение новой строки в таблице
    CTextLexeme _readNewLine();


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Идентификация буквы (большой, маленькой, русской, латинской - любой)
    static bool _isLetter(char sym);

    // Идентификация цифры (от 0 до 9)
    static bool _isDigit(char sym);

    // Идентификация обобщённого пробела (сам пробел или знак табуляции)
    static bool _isSpace(char sym);


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструирование описания позиции с ошибкой "[строка, столбец/столбец]: "
    string _errorPos();


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif

