// Файл 04_CTextParser.h
// Синтаксический анализатор текстовых данных
//

#ifndef Kernel_Parser_CTextParser_h
#define Kernel_Parser_CTextParser_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../01_Environment/01_StdLib.h"
#include "../01_Environment/02_DetectSystem.h"
#include "../01_Environment/03_CheckSystem.h"
#include "../01_Environment/04_DetectCompiler.h"
#include "../01_Environment/05_CheckCompiler.h"
#include "../01_Environment/06_SysLib.h"
#include "01_CDataMap.h"
#include "03_CTextScanner.h"


//=====================================================================================================================
// Синтаксический анализатор текстовых данных
class CTextParser
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единственный на всю программу экземпляр синтаксического анализатора
    static CTextParser myGlobalParser;


private:
    //-----------------------------------------------------------------------------------------------------------------
    CTextScanner myScanner;                 // Лексический препроцессор
    CDataMap myData;                        // Обработанные данные из файла
    string myScanResult;                    // Структура обработанных данных


private:
    //-----------------------------------------------------------------------------------------------------------------
    bool myWasError;                // Признак ошибки
    size_t myErrorLine;             // Номер строки с ошибкой
    size_t myErrorColumn;           // Номер столбца в строке с ошибкой
    size_t myErrorExtraLine;        // Номер вспомогательной строки
    size_t myErrorExtraColumn;      // Номер столбца во вспомогательной строке
    string myErrorMessage;          // Сообщение с описанием ошибки


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CTextParser();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Разбор текста
    void parse(const string &text);

    // Доступ к результатам разбора
    const CDataMap & getData() const;
    const string & getScanResult() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к информации об ошибках анализа
    bool wasError() const;
    size_t getErrorLine() const;
    size_t getErrorColumn() const;
    size_t getErrorExtraLine() const;
    size_t getErrorExtraColumn() const;
    const string & getErrorMessage() const;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Добавление данных в структуру текста
    void _collect(CTextLexeme::type t);


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструирование описания позиции с ошибкой "[строка, столбец]: "
    string _errorPos();

    // Конструирование описания вспомогательной позиции "[строка, столбец]"
    string _extraPos();

    // Конструирование полного имени элемента по стеку
    static string _construct(const list<CTextLexeme> &lexemeStack);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
// Быстрый доступ к синтаксическому анализатору
static CTextParser &Parser = CTextParser::myGlobalParser;


//=====================================================================================================================
#endif

