// Файл 01_CSysType.h
// Базовый класс для описания типа функциональных систем
//
#ifndef Core_VirtualWorld_CSysType_h
#define Core_VirtualWorld_CSysType_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"


//=====================================================================================================================
// Базовый класс для описания типа функциональных систем
class CSys;
class CObject;
class CSysType
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    string myKey;               // Ключевое слово для обозначения типа системы в текстовом файле
    string myName;              // Основное имя типа систем
    string myShowName;          // Имя типа систем для представления перед пользователем-человеком
    double myTimeStep;          // Шаг моделирования по времени работы систем данного типа


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CSysType();

    // Деструктор класса
    virtual ~CSysType() = 0;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Признак того, что это технологический пустой тип систем
    bool isNull() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Загрузка информации о типе систем из текстового файла
    virtual result load(const CDataMap &data, const string &fileName) = 0;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Создание экземпляра системы данного типа
    virtual CSys * createSystem(CObject &object) const = 0;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к характеристикам типа систем
    const string & getKey() const;
    const string & getName() const;
    const string & getShowName() const;
    double getTimeStep() const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


