// Файл 01_CSysType.cpp
// Базовый класс для описания типа функциональных систем
//
//=====================================================================================================================
// Заголовочные файлы
#include "01_CSysType.h"
#include "02_CSysTypeNull.h"




//=====================================================================================================================
// Конструктор класса
CSysType::CSysType()
{
    myTimeStep = -1.0;      // Шаг моделирования не задан
}




//=====================================================================================================================
// Деструктор класса
CSysType::~CSysType()
{
}




//=====================================================================================================================
// Признак того, что это технологический пустой тип систем
bool CSysType::isNull() const
{
    if (this == &SysTypeNull)
        return true;
    return false;
}




//=====================================================================================================================
// Загрузка информации о типе системы из текстового файла
result CSysType::load(const CDataMap &data, const string &fileName)
{
    // Выделение основного имени типа системы из имени файла
    myName = extractPureFileName(fileName);
    if (myName.empty() == true)
    {
        Log << "    Ошибка в " << fileName << ": имя файла включает только расширение!" << EndL;
        return RESULT_ERROR;
    }

    // Считывание ключевого слова, используемого для обозначения типа системы в текстовом файле
    if (extractString(data, fileName, "/Sys_Type", myKey, false,
        "поле \"Sys_Type\" не найдено!",
        "в поле \"Sys_Type\" не указано значение!",
        "в поле \"Sys_Type\" указано пустое значение!") == false)
        return RESULT_ERROR;

    // Считывание имени типа системы для представления пользователю-человеку
    if (extractString(data, fileName, "/HumanName", myShowName, false,
        "поле \"HumanName\" не найдено!",
        "в поле \"HumanName\" не указано значение!",
        "в поле \"HumanName\" указано пустое значение!") == false)
        return RESULT_ERROR;

    // Считывание шага моделирования по времени работы систем данного типа
    if (extractDoublePositive(data, fileName, "/шаг_моделирования", myTimeStep, false,
        "поле \"шаг_моделирования\" не найдено!",
        "в поле \"шаг_моделирования\" не указано значение!",
        "в поле \"шаг_моделирования\" допустимо только положительное значение!") == false)
        return RESULT_ERROR;

    // Считывание основных характеристик завершено
    return RESULT_OK;
}




//=====================================================================================================================
// Создание экземпляра системы данного типа
CSys * CSysType::createSystem(CObject &) const
{
    return NULL;
}




//=====================================================================================================================
// Доступ к характеристикам типа системы
const string & CSysType::getKey() const
{
    return myKey;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ к характеристикам типа системы
const string & CSysType::getName() const
{
    return myName;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ к характеристикам типа системы
const string & CSysType::getShowName() const
{
    return myShowName;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ к характеристикам типа системы
double CSysType::getTimeStep() const
{
    return myTimeStep;
}




