// Файл 02_CSysTypeNull.cpp
// Технологический пустой тип систем (нужен для работы с массивом типов систем)
//
//=====================================================================================================================
// Заголовочные файлы
#include "02_CSysTypeNull.h"




//=====================================================================================================================
// Единственный на всю программу технологический экземпляр пустого типа систем
CSysTypeNull CSysTypeNull::myGlobalSysTypeNull;




//=====================================================================================================================
// Конструктор класса
CSysTypeNull::CSysTypeNull()
{
}




//=====================================================================================================================
// Деструктор класса
CSysTypeNull::~CSysTypeNull()
{
}




//=====================================================================================================================
// Загрузка информации о типе системы из текстового файла
result CSysTypeNull::load(const CDataMap &data, const string &fileName)
{
    return RESULT_OK;
}




//=====================================================================================================================
// Создание экземпляра системы данного типа
CSys * CSysTypeNull::createSystem(CObject &) const
{
    return NULL;
}



