// Файл 02_CSysTypeNull.h
// Технологический пустой тип систем (нужен для работы с массивом типов систем)
//

#ifndef Core_VirtualWorld_CSysTypeNull_h
#define Core_VirtualWorld_CSysTypeNull_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "01_CSysType.h"


//=====================================================================================================================
// Технологический пустой тип систем (нужен для работы с массивом типов систем)
class CSysTypeNull: public CSysType
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единственный на всю программу технологический экземпляр пустого типа систем
    static CSysTypeNull myGlobalSysTypeNull;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CSysTypeNull();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Деструктор класса
    virtual ~CSysTypeNull();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Загрузка информации о типе системы из текстового файла
    virtual result load(const CDataMap &data, const string &fileName);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Создание экземпляра системы данного типа
    virtual CSys * createSystem(CObject &object) const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
// Быстрый доступ к пустому типу систем
static CSysTypeNull &SysTypeNull = CSysTypeNull::myGlobalSysTypeNull;


//=====================================================================================================================
#endif


