// Файл 03_CSysTypeList.h
// Массив возможных типов систем, загруженных из текстовых файлов
//

#ifndef Core_VirtualWorld_CSysTypeList_h
#define Core_VirtualWorld_CSysTypeList_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "01_CSysType.h"
#include "02_CSysTypeNull.h"


//=====================================================================================================================
// Массив возможных типов систем, загруженных из текстовых файлов
class CSysTypeList
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единый на всю программу глобальный массив возможных типов систем (база типов систем)
    static CSysTypeList myGlobalSysTypeList;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Тип данных "Указатель на функцию создания типа систем по ключу"
    typedef CSysType * (*createSysTypeFunc)(const string &);


private:
    //-----------------------------------------------------------------------------------------------------------------
    vector<CSysType *> mySysTypeList;       // Массив типов систем
    createSysTypeFunc myCreateSysFunc;      // Указатель на функцию создания типа систем по ключу


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CSysTypeList();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Деструктор класса
    ~CSysTypeList();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Поиск типа систем по основному имени
    size_t find(const string &name) const;

    // Доступ к типу систем по индексу
    const CSysType & get(size_t index) const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Загрузка информации о типах систем из текстовых файлов
    bool load(const string &systemsDir);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Указание функции создания типа систем по ключу
    void setCreateSysType(createSysTypeFunc csf);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
// Быстрый доступ к массиву типов систем
static CSysTypeList &SysTypeList = CSysTypeList::myGlobalSysTypeList;


//=====================================================================================================================
#endif


