// Файл 04_CSys.cpp
// Базовый класс для модели функциональной системы
//

//=====================================================================================================================
// Заголовочные файлы
#include "01_CSysType.h"
#include "04_CSys.h"
#include "05_CSysNull.h"




//=====================================================================================================================
// Конструктор класса
CSys::CSys(const CSysType &sysType, CObject &object)
{
    mySysTypePtr = &sysType;
    myObjectPtr = &object;
    myNextTime = 0.0;
}




//=====================================================================================================================
// Деструктор класса
CSys::~CSys()
{
}




//=====================================================================================================================
// Признак того, что это технологическая пустая система
bool CSys::isNull() const
{
    if (this == &SysNull)
        return true;
    return false;
}




//=====================================================================================================================
// Доступ к типу системы
const CSysType & CSys::getType() const
{
    return *mySysTypePtr;
}




//=====================================================================================================================
// Доступ к объекту, частью которого является система
const CObject & CSys::getObject() const
{
    return *myObjectPtr;
}




//---------------------------------------------------------------------------------------------------------------------
// Доступ к объекту, частью которого является система
CObject & CSys::getObject()
{
    return *myObjectPtr;
}




//=====================================================================================================================
// Доступ к моменту следующей активации
double CSys::getNextTime() const
{
    return myNextTime;
}




//=====================================================================================================================
// Управление работой системы
void CSys::appear(double time)
{    
    // Вычисление следующего момента активации
    myNextTime = time + mySysTypePtr->getTimeStep();

    // Выполнение действий
    onAppear(time);
}




//---------------------------------------------------------------------------------------------------------------------
// Управление работой системы
void CSys::destroy(double time)
{
    // Выполнение действий
    onDestroy(time);
}




//---------------------------------------------------------------------------------------------------------------------
// Управление работой системы
void CSys::activate(double time)
{
    // Вычисление следующего момента активации
    myNextTime = time + mySysTypePtr->getTimeStep();

    // Выполнение действий
    onActivate(time);
}




//---------------------------------------------------------------------------------------------------------------------
// Управление работой системы
void CSys::disappear(double time)
{
    // Выполнение действий
    onDisappear(time);
}




//=====================================================================================================================
// Сменные алгоритмы действий
void CSys::onAppear(double)
{
}




//---------------------------------------------------------------------------------------------------------------------
// Сменные алгоритмы действий
void CSys::onDestroy(double)
{
}




//---------------------------------------------------------------------------------------------------------------------
// Сменные алгоритмы действий
void CSys::onActivate(double)
{
}




//---------------------------------------------------------------------------------------------------------------------
// Сменные алгоритмы действий
void CSys::onDisappear(double)
{
}




//---------------------------------------------------------------------------------------------------------------------
// Сменные алгоритмы действий
void CSys::onTaskCmd(const CTaskCmd &)
{
}




//---------------------------------------------------------------------------------------------------------------------
// Сменные алгоритмы действий
void CSys::onTaskPoint(const CTaskPoint &)
{
}




//---------------------------------------------------------------------------------------------------------------------
// Сменные алгоритмы действий
void CSys::onImpact(double, const CImpact &)
{
}




//---------------------------------------------------------------------------------------------------------------------
// Сменные алгоритмы действий
bool CSys::onRequest(double, CRequest &)
{
    return false;
}

