// Файл 04_CSys.h
// Базовый класс для модели функциональной системы
//

#ifndef Core_VirtualWorld_CSys_h
#define Core_VirtualWorld_CSys_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../02_TaskReader/01_CTaskPoint.h"
#include "../02_TaskReader/02_CTaskCmd.h"
#include "../03_DataExchange/01_CImpact.h"
#include "../03_DataExchange/02_CRequest.h"
#include "01_CSysType.h"


//=====================================================================================================================
// Базовый класс для модели функциональной системы
class CObject;
class CSys
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    const CSysType *mySysTypePtr;       // Адрес типа системы, представителем которого является система
    CObject *myObjectPtr;               // Адрес моделируемого объекта, в состав которого входит система
    double myNextTime;                  // Момент следующей активации системы


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CSys(const CSysType &sysType, CObject &object);

    // Деструктор класса
    virtual ~CSys() = 0;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Признак того, что это технологическая пустая система
    bool isNull() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к типу системы
    virtual const CSysType & getType() const = 0;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к объекту, частью которого является система
    const CObject & getObject() const;
    CObject & getObject();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к моменту следующей активации
    double getNextTime() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Управление работой системы
    void appear(double time);
    void destroy(double time);
    void activate(double time);
    void disappear(double time);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Сменные алгоритмы действий
    virtual void onAppear(double time);
    virtual void onDestroy(double time);
    virtual void onActivate(double time);
    virtual void onDisappear(double time);

    virtual void onTaskCmd(const CTaskCmd &taskCmd);
    virtual void onTaskPoint(const CTaskPoint &taskPoint);
    virtual void onImpact(double time, const CImpact &impact);
    virtual bool onRequest(double time, CRequest &request);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


