// Файл 05_CSysNull.h
// Технологическая пустая система (нужна для работы с моделируемым объектом)
//

#ifndef Core_VirtualWorld_CSysNull_h
#define Core_VirtualWorld_CSysNull_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "04_CSys.h"


//=====================================================================================================================
// Технологическая пустая система (нужна для работы с моделируемым объектом)
class CSysNull: public CSys
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единственный на всю программу технологический экземпляр пустой системы
    static CSysNull myGlobalSysNull;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CSysNull();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Деструктор класса
    virtual ~CSysNull();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к типу системы
    virtual const CSysType & getType() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Сменные алгоритмы действий
    virtual void onAppear(double time);
    virtual void onDestroy(double time);
    virtual void onActivate(double time);
    virtual void onDisappear(double time);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
// Быстрый доступ к пустой системе
static CSysNull &SysNull = CSysNull::myGlobalSysNull;


//=====================================================================================================================
#endif


