// Файл 05_CSysNull.cpp
// Технологическая пустая система (нужна для работы с моделируемым объектом)
//

//=====================================================================================================================
// Заголовочные файлы
#include "02_CSysTypeNull.h"
#include "05_CSysNull.h"
#include "10_CObject.h"




//=====================================================================================================================
// Единственный на всю программу технологический экземпляр пустой системы
CSysNull CSysNull::myGlobalSysNull;




//=====================================================================================================================
// Конструктор класса
CSysNull::CSysNull()
    : CSys(SysTypeNull, ObjectNull)
{
}




//=====================================================================================================================
// Деструктор класса
CSysNull::~CSysNull()
{
}




//=====================================================================================================================
// Доступ к типу системы
const CSysType & CSysNull::getType() const
{
    return SysTypeNull;
}




//=====================================================================================================================
// Сменные алгоритмы действий
void CSysNull::onAppear(double)
{
}




//---------------------------------------------------------------------------------------------------------------------
// Сменные алгоритмы действий
void CSysNull::onDestroy(double)
{
}




//---------------------------------------------------------------------------------------------------------------------
// Сменные алгоритмы действий
void CSysNull::onActivate(double)
{
}




//---------------------------------------------------------------------------------------------------------------------
// Сменные алгоритмы действий
void CSysNull::onDisappear(double)
{
}




