// Файл 06_CSysMotionType.cpp
// Базовый класс для описания типа системы движения моделируемого объекта
//

//=====================================================================================================================
// Заголовочные файлы
#include "06_CSysMotionType.h"
#include "07_CSysMotion.h"




//=====================================================================================================================
// Конструктор класса
CSysMotionType::CSysMotionType()
{
}




//=====================================================================================================================
// Деструктор класса
CSysMotionType::~CSysMotionType()
{
}




//=====================================================================================================================
// Загрузка информации о типе системы из текстового файла
result CSysMotionType::load(const CDataMap &data, const string &fileName)
{
    return CSysType::load(data, fileName);
}




//=====================================================================================================================
// Создание экземпляра системы данного типа
CSys * CSysMotionType::createSystem(CObject &object) const
{
    return new CSysMotion(*this, object);
}



