// Файл 06_CSysMotionType.h
// Базовый класс для описания типа системы движения моделируемого объекта
//
#ifndef Core_VirtualWorld_CSysMotionType_h
#define Core_VirtualWorld_CSysMotionType_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "01_CSysType.h"


//=====================================================================================================================
// Базовый класс для описания типа системы движения моделируемого объекта
class CSysMotionType: public CSysType
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CSysMotionType();

    // Деструктор класса
    virtual ~CSysMotionType();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Загрузка информации о типе системы из текстового файла
    virtual result load(const CDataMap &data, const string &fileName);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Создание экземпляра системы данного типа
    virtual CSys * createSystem(CObject &object) const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


