// Файл 07_CSysMotion.h
// Базовый класс для системы движения моделируемого объекта
//

#ifndef Core_VirtualWorld_CSysMotion_h
#define Core_VirtualWorld_CSysMotion_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "../02_TaskReader/01_CTaskPoint.h"
#include "../02_TaskReader/03_CTaskObject.h"
#include "04_CSys.h"
#include "06_CSysMotionType.h"


//=====================================================================================================================
// Базовый класс для системы движения моделируемого объекта
class CSysMotion: public CSys
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    vector<CTaskPoint> myInitialRoute;      // Базовый маршрут движения
    CTaskPoint myLastFixedPoint;            // Последнее точно вычисленное положение объекта


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CSysMotion(const CSysType &sysType, CObject &object);

    // Деструктор класса
    virtual ~CSysMotion();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к типу системы
    virtual const CSysMotionType & getType() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Управление работой системы
    bool routeEnd(double time);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Сменные алгоритмы действий
    virtual bool onRouteEnd(double time);
    virtual void onTaskPoint(const CTaskPoint &taskPoint);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Вычисление текущего положения моделируемого объекта
    CTaskPoint computePoint(double time) const;

    // Управление последним вычисленным положением моделируемого объекта
    const CTaskPoint & getLastFixedPoint() const;
    void saveLastFixedPoint(const CTaskPoint &point);

    // Управление начальным маршрутом движения моделируемого объекта
    const vector<CTaskPoint> & getInitialRoute() const;
    void setInitialRoute(const vector<CTaskPoint> &route);
    void takeInitialRoute(const CTaskObject &taskObject);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


