// Файл 10_CObject.h
// Описание моделируемого объекта
//

#ifndef Core_VirtualWorld_CObject_h
#define Core_VirtualWorld_CObject_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "04_CSys.h"
#include "07_CSysMotion.h"


//=====================================================================================================================
// Описание моделируемого объекта
class CObjectType;
class CObject
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единственный на всю программу технологический экземпляр пустого объекта
    static CObject myGlobalObjectNull;


private:
    //-----------------------------------------------------------------------------------------------------------------
    const CObjectType *myTypePtr;   // Адрес типа объектов, представителем которого является данный объект
    vector<CSys *> mySysList;       // Перечень функциональных систем (система движения всегда первая)
    size_t myAbsNum;                // Глобальный порядковый номер объекта
    string myName;                  // Имя объекта в виртуальном Мире (по нему можно сослаться на объект)
    bool myIsExist;                 // Признак существования объекта
    bool myIsRed;                   // Признак принадлежности объекта к "Красным"


private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myParentNum;             // Номер вышестоящего по иерархии объекта
    set<size_t> myChildrenList;     // Список номеров нижестоящих по иерархии объектов


private:
    //-----------------------------------------------------------------------------------------------------------------
    uint32 myFilmId;                // Идентификатор объекта в фильме
     

public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CObject(const CObjectType &objectType, size_t absNum, bool isRed);
    CObject(const CObjectType &objectType, size_t absNum, size_t parentNum, bool isRed);

    // Деструктор класса
    ~CObject();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Признак того, что это технологический пустой объект
    bool isNull() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к типу объекта
    const CObjectType & getType() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к системам объекта
    size_t getSysCount() const;
    const CSys & getSys(size_t index) const;
    CSys & getSys(size_t index);

    // Доступ к системе движения
    const CSysMotion & getSysMotion() const;
    CSysMotion & getSysMotion();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к параметрам объекта
    size_t getAbsNum() const;
    bool isExist() const;
    bool isRed() const;

    size_t getParentNum() const;
    const set<size_t> & getChildrenList() const;

    uint32 getFilmId() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Управление именем объекта в виртуальном мире
    const string & getName() const;
    void setName(const string &name);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Управление существованием объекта
    void appear(double time);       // Появление объекта
    void destroy(double time);      // Уничтожение (поражение/гибель) объекта
    bool routeEnd(double time);     // Конец маршрута движения
    void disappear(double time);    // Исчезновение объекта


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Управление передачей информации
    void processTaskCmd(const CTaskCmd &taskCmd);
    void processTaskPoint(const CTaskPoint &taskPoint);
    void processImpact(double time, const CImpact &impact);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
// Быстрый доступ к пустому объекту
static CObject &ObjectNull = CObject::myGlobalObjectNull;


//=====================================================================================================================
#endif


