// Файл 11_CObjectType.h
// Описания типа моделируемого объекта
//

#ifndef Core_VirtualWorld_CObjectType_h
#define Core_VirtualWorld_CObjectType_h


//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "01_CSysType.h"
#include "10_CObject.h"


//=====================================================================================================================
// Описания типа моделируемого объекта
class CObjectType
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единственный на всю программу технологический экземпляр пустого типа объектов
    static CObjectType myGlobalObjectTypeNull;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Виды моделируемых объектов
    enum kind
    {
        AIR = 0,        // Воздушный объект
        GROUND          // Наземный объект
    };


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Описание вооружения
    struct weapon
    {
        string type;        // Тип вооружения
        size_t count;       // Количество вооружения
    };


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Описание варианта вооружения
    struct equipment
    {
        string name;                    // Название варианта вооружения
        string type;                    // Тип вооружения
        vector<weapon> weaponList;      // Список оружия
    };


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единственный на всю программу технологический экземпляр пустого варианта оснащения
    static equipment myEmptyEquipment;  // Пустой вариант оснащения


private:
    //-----------------------------------------------------------------------------------------------------------------
    vector<size_t> mySysTypeIndexList;      // Список индексов типов систем в составе моделируемого объекта
    string myName;                          // Основное имя типа объектов
    string myShowName;                      // Имя типа объектов для представления перед пользователем-человеком
    vector<string> myPropertyList;          // Список свойств объектов (связанных с объектами текстовых меток)
    kind myKind;                            // Природа объектов данного типа
    bool myIsWeapon;                        // Признак, что данный объект является оружием
    double myHeight;                        // Высота объекта      

public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CObjectType();

    // Деструктор класса
    ~CObjectType();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Признак того, что это технологический пустой тип объектов
    bool isNull() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Загрузка информации о типе объектов из текстового файла
    result load(const CDataMap &data, const string &fileName);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Создание экземпляра объекта данного типа
    CObject createObject(size_t absNum, bool isRed) const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к характеристикам типа объектов
    const string & getName() const;
    const string & getShowName() const;
    kind getKind() const;
    bool isWeapon() const;
    double getHeight() const;   

public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к типам систем объектов данного типа
    size_t getSysTypeCount() const;
    const CSysType & getSysType(size_t index) const;


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
// Быстрый доступ к пустому типу объектов
static CObjectType &ObjectTypeNull = CObjectType::myGlobalObjectTypeNull;


//=====================================================================================================================
#endif


