// Файл 12_CObjectTypeList.h
// Массив возможных типов объектов, загруженных из текстовых файлов
//

#ifndef Core_VirtualWorld_CObjectTypeList_h
#define Core_VirtualWorld_CObjectTypeList_h



//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "11_CObjectType.h"



//=====================================================================================================================
// Массив возможных типов объектов, загруженных из текстовых файлов
class CObjectTypeList
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единый на всю программу глобальный массив возможных типов объектов (база типов объектов)
    static CObjectTypeList myGlobalObjectTypeList;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Массив типов объектов
    vector<CObjectType> myObjectTypeList;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CObjectTypeList();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Поиск типа объекта по имени типа объектов
    size_t find(const string &name) const;

    // Доступ к типу объектов по индексу
    const CObjectType & get(size_t index) const;

    // Доступ к количеству типов объектов
    size_t count() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Загрузка информации о типах объектов из текстовых файлов
    bool load(const string &objectsDir);


    //-----------------------------------------------------------------------------------------------------------------
};



//=====================================================================================================================
// Быстрый доступ к массиву типов объектов
static CObjectTypeList &ObjectTypeList = CObjectTypeList::myGlobalObjectTypeList;



//=====================================================================================================================
#endif


