// Файл 13_CObjectList.h
// Массив моделируемых объектов
//

#ifndef Core_VirtualWorld_CObjectList_h
#define Core_VirtualWorld_CObjectList_h



//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"
#include "10_CObject.h"



//=====================================================================================================================
// Массив моделируемых объектов
class CObjectList
{
public:
    //-----------------------------------------------------------------------------------------------------------------
    // Единый на всю программу глобальный массив моделируемых объектов
    static CObjectList myGlobalObjectList;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Массив типов объектов
    vector<CObject *> myObjectList;


private:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CObjectList();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Деструктор класса
    ~CObjectList();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Создание нового моделируемого объекта
    size_t createObject(const CObjectType &objectType, bool isRed);
    size_t createObject(const CObjectType &objectType, size_t parentNum, bool isRed);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к моделируемым объектам
    const CObject & getObject(size_t absNum) const;
    CObject & getObject(size_t absNum);
    size_t getObjectCount() const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Рассылка воздействия существующим объектам
    void processImpact(size_t senderAbsNum, double time, const CImpact &impact);


    //-----------------------------------------------------------------------------------------------------------------
};



//=====================================================================================================================
// Быстрый доступ к массиву объектов
static CObjectList &ObjectList = CObjectList::myGlobalObjectList;



//=====================================================================================================================
#endif


