// Файл FrontEnd.h
// Точка подключения всех возможностей блока 330_MotionMissileSimple
//

#ifndef _330_MotionMissileSimple_FrontEnd_h
#define _330_MotionMissileSimple_FrontEnd_h




//=====================================================================================================================
// Сюда надо подключать заголовочные файлы данного проекта
#include "Settings.h"




//=====================================================================================================================
// Описание новой системы и её типа
#include "90_System/01_CSysMotionMissileSimpleType.h"
#include "90_System/02_CSysMotionMissileSimple.h"




//=====================================================================================================================
// Подключение файла статической библиотеки при компиляции
#if !defined(USED_CMAKE_BUILD_TOOL)   &&   defined(COMPILER_MICROSOFT)
__pragma(comment(lib, "330_MotionMissileSimple"))
#endif




//=====================================================================================================================
#endif
