#ifndef _226_NavedenieZPS_System_CSysMotionNewType_h
#define _226_NavedenieZPS_System_CSysMotionNewType_h




//=====================================================================================================================
// Заголовочные файлы
#include "../Settings.h"




//=====================================================================================================================
// Описание нового типа функциональных систем движения
class CSysMotionNewType: public CSysMotionType
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    double myParamOne;      // Какой-нибудь параметр
    string myParamTwo;      // Какой-нибудь другой параметр


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CSysMotionNewType();

    // Деструктор класса
    virtual ~CSysMotionNewType();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Загрузка информации о типе систем из текстового файла
    virtual result load(const CDataMap &data, const string &fileName);


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Создание экземпляра системы данного типа
    virtual CSys * createSystem(CObject &object) const;


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Доступ к характеристикам типа систем
    double getParamOne() const;
    const string & getParamTwo() const;


    //-----------------------------------------------------------------------------------------------------------------
};




//=====================================================================================================================
#endif


