//=====================================================================================================================
// «аголовочные файлы
#include "01_CSysMotionNewType.h"
#include "02_CSysMotionNew.h"




//=====================================================================================================================
//  онструктор класса
CSysMotionNewType::CSysMotionNewType()
{
    // ”казание начальных значений параметров
    myParamOne = 1.0;

    // «амечание 1
    // «начение параметра myParamOne €вно указываетс€, потому что это переменна€
    // простого встроенного типа. ѕо умолчанию, начальное значение ей не присваиваетс€

    // «амечание 2
    // «начение параметра myParamTwo не указываетс€, потому это переменна€ типа string.
    //  онструктор класса string автоматически присвоит этой переменной начальное значение
}




//=====================================================================================================================
// ƒеструктор класса
CSysMotionNewType::~CSysMotionNewType()
{
}




//=====================================================================================================================
// «агрузка информации о типе системы из текстового файла
result CSysMotionNewType::load(const CDataMap &data, const string &fileName)
{
    // ѕризнак наличи€ предупреждений при считывании параметров типа системы
    bool wereWarnings = false;      // изначально полагаем, что предупреждений не будет

    // —читывание общей информации, присутствущей в любом файле с описанием типа системы
    if (CSysType::load(data, fileName) == RESULT_ERROR)
        return RESULT_ERROR;

    // —читывание значени€ первого нового параметра (это об€зательный параметр)
    if (extractDoublePositive(data, fileName, "/числовой_параметр", myParamOne, false,
        "поле \"числовой_параметр\" не найдено!",
        "в поле \"числовой_параметр\" не указано значение!",
        "в поле \"числовой_параметр\" допустимо только положительное значение!") == false)
        return RESULT_ERROR;

    // —читывание значени€ первого нового параметра (это необ€зательный параметр)
    if (extractString(data, fileName, "/строковый_параметр", myParamTwo, false,
        "поле \"строковый_параметр\" не найдено!",
        "в поле \"строковый_параметр\" не указано значение!",
        "в поле \"строковый_параметр\" указано пустое значение!") == false)
        wereWarnings = true;

    // —читывание параметров завершено
    if (wereWarnings == true)
        return RESULT_WARNING;
    return RESULT_OK;
}




//=====================================================================================================================
// —оздание экземпл€ра системы данного типа
CSys * CSysMotionNewType::createSystem(CObject &object) const
{
    return new CSysMotionNew(*this, object);
}




//=====================================================================================================================
// ƒоступ к характеристикам типа систем
double CSysMotionNewType::getParamOne() const
{
    return myParamOne;
}




//---------------------------------------------------------------------------------------------------------------------
const string & CSysMotionNewType::getParamTwo() const
{
    return myParamTwo;
}



