// Файл 01_CRequestAmmunition.cpp
// Запрос боекомплекта
//

//=====================================================================================================================
// Заголовочные файлы
#include "01_CRequestAmmunition.h"




//=====================================================================================================================
// Конструктор класса
CRequestAmmunition::CRequestAmmunition()
{
    myAmmunition = 0;
}




//=====================================================================================================================
// Деструктор класса
CRequestAmmunition::~CRequestAmmunition()
{
}




//=====================================================================================================================
// Управление результатами запроса
uint32 CRequestAmmunition::getAmmunition() const
{
    return myAmmunition;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
const string & CRequestAmmunition::getWeaponName() const
{
    return myWeaponName;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
void CRequestAmmunition::setAmmunition(uint32 ammunition)
{
    myAmmunition = ammunition;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
void CRequestAmmunition::setWeaponName(const string &weaponName)
{
    myWeaponName = weaponName;
}
