// Файл 01_CRequestAmmunition.h
// Запрос боекомплекта
//

#ifndef Core_DataExchange_CRequestAmmunition_h
#define Core_DataExchange_CRequestAmmunition_h


//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../02_CRequest.h"


//=====================================================================================================================
// Запрос боекомплекта
class CRequestAmmunition: public CRequest
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    string myWeaponName;        // Название оружия (результат запроса)
    uint32 myAmmunition;        // Боекомплект (результат запроса)


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    CRequestAmmunition();

    // Деструктор класса
    virtual ~CRequestAmmunition();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Управление результатами запроса
    uint32 getAmmunition() const;
    const string & getWeaponName() const;

    void setAmmunition(uint32 ammunition);
    void setWeaponName(const string &weaponName);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


