// Файл 03_CRequestServiceTime.cpp
// Класс "Запрос времени обслуживания данной системой пуска цели"
//

//=====================================================================================================================
// Заголовочные файлы
#include "03_CRequestServiceTime.h"




//=====================================================================================================================
// Конструктор класса
CRequestServiceTime::CRequestServiceTime(const size_t targetNum)
    : myTargetNum(targetNum), myServiceTime(-1)
{
}




//=====================================================================================================================
// Деструктор класса
CRequestServiceTime::~CRequestServiceTime()
{
}



//=====================================================================================================================
// Управление параметрами запроса
size_t CRequestServiceTime::getTargetNum() const
{
    return myTargetNum;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление параметрами запроса
void CRequestServiceTime::setTargetNum(const size_t targetNum)
{
    myTargetNum = targetNum;
}




//=====================================================================================================================
// Управление результатами запроса
double CRequestServiceTime::getServiceTime() const
{
    return myServiceTime;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
void CRequestServiceTime::setServiceTime(const double time)
{
    myServiceTime = time;
}


