// Файл 03_CRequestServiceTime.h
// Класс "Запрос времени обслуживания данной системой пуска цели"
//

#ifndef Core_DataExchange_CRequestServiceTime_h
#define Core_DataExchange_CRequestServiceTime_h


//=====================================================================================================================
// Заголовочные файлы
#include "../../Settings.h"
#include "../02_CRequest.h"


//=====================================================================================================================
// Класс "Запрос времени обслуживания данной системой пуска цели"
class CRequestServiceTime : public CRequest
{
private:
    //-----------------------------------------------------------------------------------------------------------------
    size_t myTargetNum;          // Номер обсуживаемой цели (параметр запроса)
    double myServiceTime;        // Время обслуживания (результат запроса)


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Конструктор класса
    explicit CRequestServiceTime(size_t targetNum);

    // Деструктор класса
    virtual ~CRequestServiceTime();


public:
    //-----------------------------------------------------------------------------------------------------------------
    // Управление параметрами запроса
    size_t getTargetNum() const;

    void setTargetNum(size_t targetNum);

    //-----------------------------------------------------------------------------------------------------------------
    // Управление результатами запроса
    double getServiceTime() const;
    void setServiceTime(double time);


    //-----------------------------------------------------------------------------------------------------------------
};


//=====================================================================================================================
#endif


