// Файл 06_CRequestAmmunitionParam.cpp
// Запрос параметров вооружения
//

//=====================================================================================================================
// Заголовочные файлы
#include "06_CRequestAmmunitionParam.h"




//=====================================================================================================================
// Конструктор класса
CRequestAmmunitionParam::CRequestAmmunitionParam()
{
    myMissile_DpmMax = 0;
    myMissile_sekt = 0;
    myR_os = 0;
}




//=====================================================================================================================
// Деструктор класса
CRequestAmmunitionParam::~CRequestAmmunitionParam()
{
}




//=====================================================================================================================
// Управление результатами запроса
const string& CRequestAmmunitionParam::getWeaponName() const
{
    return myWeaponName;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
double CRequestAmmunitionParam::getMissile_DpmMax() const
{
    return myMissile_DpmMax;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
double CRequestAmmunitionParam::getMissile_sekt() const
{
    return myMissile_sekt;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
double CRequestAmmunitionParam::getR_os() const
{
    return myR_os;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
void CRequestAmmunitionParam::setWeaponName(const string& weaponName)
{
    myWeaponName = weaponName;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
void CRequestAmmunitionParam::setMissile_DpmMax(double inMissile_Dpm)
{
    myMissile_DpmMax = inMissile_Dpm;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
void CRequestAmmunitionParam::setMissile_sekt(double inMissile_sekt)
{
    myMissile_sekt = inMissile_sekt;
}




//---------------------------------------------------------------------------------------------------------------------
// Управление результатами запроса
void CRequestAmmunitionParam::setR_os(double inR_os)
{
    myR_os = inR_os;
}





